   - [#   8] AOR MRTD: 
--------------------------------------------------------------------------------
  113: 
  114: def validateDate(date):
  115:     for char in date:
  116:         if (char != '<' and (char < '0' or char > '9')):
- 117:             raise Exception(('Invalid character ' + char) + ' in date')
+ 117:             raise Exception(('Invalid character ' - char) + ' in date')
  118: 
  119: 
  120: 
  121: def scanMRZ():
--------------------------------------------------------------------------------
[0.00201 s] survived

   - [#   9] AOR MRTD: 
--------------------------------------------------------------------------------
  113: 
  114: def validateDate(date):
  115:     for char in date:
  116:         if (char != '<' and (char < '0' or char > '9')):
- 117:             raise Exception(('Invalid character ' + char) + ' in date')
+ 117:             raise Exception(('Invalid character ' + char) - ' in date')
  118: 
  119: 
  120: 
  121: def scanMRZ():
--------------------------------------------------------------------------------
[0.00201 s] survived

   - [#  14] AOR MRTD: 
--------------------------------------------------------------------------------
  138:     travelData.issuingCountry = line1[linePos:linePos + 3]
  139:     linePos += 3
  140:     while line1[linePos] != '<':
  141:         if (line1[linePos] < 'A' or line1[linePos] > 'Z'):
- 142:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
+ 142:             raise Exception(('Invalid character ' - line1[linePos]) + ' in last name')
  143:         currentString += line1[linePos]
  144:         linePos += 1
  145:     travelData.lastName = currentString
  146:     linePos += 2
--------------------------------------------------------------------------------
[0.00200 s] survived

   - [#  15] AOR MRTD: 
--------------------------------------------------------------------------------
  138:     travelData.issuingCountry = line1[linePos:linePos + 3]
  139:     linePos += 3
  140:     while line1[linePos] != '<':
  141:         if (line1[linePos] < 'A' or line1[linePos] > 'Z'):
- 142:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
+ 142:             raise Exception(('Invalid character ' + line1[linePos]) - ' in last name')
  143:         currentString += line1[linePos]
  144:         linePos += 1
  145:     travelData.lastName = currentString
  146:     linePos += 2
--------------------------------------------------------------------------------
[0.00306 s] survived

   - [#  16] AOR MRTD: 
--------------------------------------------------------------------------------
  146:     linePos += 2
  147:     currentString = ''
  148:     while line1[linePos] != '<':
  149:         if (line1[linePos] < 'A' or line1[linePos] > 'Z'):
- 150:             raise Exception(('Invalid character ' + line1[linePos]) + ' in first name')
+ 150:             raise Exception(('Invalid character ' - line1[linePos]) + ' in first name')
  151:         currentString += line1[linePos]
  152:         linePos += 1
  153:     travelData.firstName = currentString
  154:     linePos += 1
--------------------------------------------------------------------------------
[0.00200 s] survived

   - [#  17] AOR MRTD: 
--------------------------------------------------------------------------------
  146:     linePos += 2
  147:     currentString = ''
  148:     while line1[linePos] != '<':
  149:         if (line1[linePos] < 'A' or line1[linePos] > 'Z'):
- 150:             raise Exception(('Invalid character ' + line1[linePos]) + ' in first name')
+ 150:             raise Exception(('Invalid character ' + line1[linePos]) - ' in first name')
  151:         currentString += line1[linePos]
  152:         linePos += 1
  153:     travelData.firstName = currentString
  154:     linePos += 1
--------------------------------------------------------------------------------
[0.00367 s] survived

   - [#  18] AOR MRTD: 
--------------------------------------------------------------------------------
  154:     linePos += 1
  155:     currentString = ''
  156:     while line1[linePos] != '<':
  157:         if (line1[linePos] < 'A' or line1[linePos] > 'Z'):
- 158:             raise Exception(('Invalid character ' + line1[linePos]) + ' in middle name')
+ 158:             raise Exception(('Invalid character ' - line1[linePos]) + ' in middle name')
  159:         currentString += line1[linePos]
  160:         linePos += 1
  161:     travelData.middleName = currentString
  162:     currentString = ''
--------------------------------------------------------------------------------
[0.00200 s] survived

   - [#  19] AOR MRTD: 
--------------------------------------------------------------------------------
  154:     linePos += 1
  155:     currentString = ''
  156:     while line1[linePos] != '<':
  157:         if (line1[linePos] < 'A' or line1[linePos] > 'Z'):
- 158:             raise Exception(('Invalid character ' + line1[linePos]) + ' in middle name')
+ 158:             raise Exception(('Invalid character ' + line1[linePos]) - ' in middle name')
  159:         currentString += line1[linePos]
  160:         linePos += 1
  161:     travelData.middleName = currentString
  162:     currentString = ''
--------------------------------------------------------------------------------
[0.00199 s] survived

   - [#  36] AOR MRTD: 
--------------------------------------------------------------------------------
  199:     data = getTravelDataFromDB(personalNo)
  200:     
  201:     line1 = ((((((data.docType + '<') + data.issuingCountry) + data.lastName) + '<<') + data.firstName) + '<') + data.middleName
  202:     if len(line1) > LINE_LENGTH:
- 203:         raise Exception(('First line is not ' + str(LINE_LENGTH)) + ' characters.')
+ 203:         raise Exception(('First line is not ' - str(LINE_LENGTH)) + ' characters.')
  204:     while len(line1) < LINE_LENGTH:
  205:         line1 += '<'
  206:     
  207:     
--------------------------------------------------------------------------------
[0.00301 s] survived

   - [#  37] AOR MRTD: 
--------------------------------------------------------------------------------
  199:     data = getTravelDataFromDB(personalNo)
  200:     
  201:     line1 = ((((((data.docType + '<') + data.issuingCountry) + data.lastName) + '<<') + data.firstName) + '<') + data.middleName
  202:     if len(line1) > LINE_LENGTH:
- 203:         raise Exception(('First line is not ' + str(LINE_LENGTH)) + ' characters.')
+ 203:         raise Exception(('First line is not ' + str(LINE_LENGTH)) - ' characters.')
  204:     while len(line1) < LINE_LENGTH:
  205:         line1 += '<'
  206:     
  207:     
--------------------------------------------------------------------------------
[0.00199 s] survived

   - [#  47] AOR MRTD: 
--------------------------------------------------------------------------------
  207:     
  208:     line2 = ((((((((data.passportNo + data.passportCheck) + data.countryCode) + data.birthday) + data.birthdayCheck) + data.sex) + data.expirationDate) + data.expirationCheck) + data.personalNo) + data.personalNoCheck
  209:     
  210:     if len(line2) != LINE_LENGTH:
- 211:         raise Exception(('Second line is not ' + str(LINE_LENGTH)) + ' characters.')
+ 211:         raise Exception(('Second line is not ' - str(LINE_LENGTH)) + ' characters.')
  212:     return (line1, line2)
  213: 
  214: 
  215: 
--------------------------------------------------------------------------------
[0.00300 s] survived

   - [#  48] AOR MRTD: 
--------------------------------------------------------------------------------
  207:     
  208:     line2 = ((((((((data.passportNo + data.passportCheck) + data.countryCode) + data.birthday) + data.birthdayCheck) + data.sex) + data.expirationDate) + data.expirationCheck) + data.personalNo) + data.personalNoCheck
  209:     
  210:     if len(line2) != LINE_LENGTH:
- 211:         raise Exception(('Second line is not ' + str(LINE_LENGTH)) + ' characters.')
+ 211:         raise Exception(('Second line is not ' + str(LINE_LENGTH)) - ' characters.')
  212:     return (line1, line2)
  213: 
  214: 
  215: 
--------------------------------------------------------------------------------
[0.00299 s] survived

   - [#  63] ASR MRTD: 
--------------------------------------------------------------------------------
  171:     travelData.countryCode = line2[linePos:linePos + COUNTRY_CODE_LENGTH]
  172:     linePos += COUNTRY_CODE_LENGTH
  173:     travelData.birthday = line2[linePos:linePos + DATE_LENGTH]
  174:     validateDate(travelData.birthday)
- 175:     linePos += DATE_LENGTH
+ 175:     linePos -= DATE_LENGTH
  176:     travelData.birthdayCheck = line2[linePos:linePos + 1]
  177:     linePos += 1
  178:     travelData.sex = line2[linePos:linePos + SEX_LENGTH]
  179:     linePos += 1
--------------------------------------------------------------------------------
[0.00200 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  66] ASR MRTD: 
--------------------------------------------------------------------------------
  178:     travelData.sex = line2[linePos:linePos + SEX_LENGTH]
  179:     linePos += 1
  180:     travelData.expirationDate = line2[linePos:linePos + DATE_LENGTH]
  181:     validateDate(travelData.expirationDate)
- 182:     linePos += DATE_LENGTH
+ 182:     linePos -= DATE_LENGTH
  183:     travelData.expirationCheck = line2[linePos:linePos + 1]
  184:     linePos += 1
  185:     travelData.personalNo = line2[linePos:len(line2) - 1]
  186:     linePos = len(line2) - 1
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  71] COI MRTD: 
--------------------------------------------------------------------------------
  112:     return total % 10
  113: 
  114: def validateDate(date):
  115:     for char in date:
- 116:         if (char != '<' and (char < '0' or char > '9')):
+ 116:         if not ((char != '<' and (char < '0' or char > '9'))):
  117:             raise Exception(('Invalid character ' + char) + ' in date')
  118: 
  119: 
  120: 
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  74] COI MRTD: 
--------------------------------------------------------------------------------
  137:     linePos += 2
  138:     travelData.issuingCountry = line1[linePos:linePos + 3]
  139:     linePos += 3
  140:     while line1[linePos] != '<':
- 141:         if (line1[linePos] < 'A' or line1[linePos] > 'Z'):
+ 141:         if not ((line1[linePos] < 'A' or line1[linePos] > 'Z')):
  142:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  143:         currentString += line1[linePos]
  144:         linePos += 1
  145:     travelData.lastName = currentString
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  79] COI MRTD: 
--------------------------------------------------------------------------------
  198: def encodeMRZ(personalNo):
  199:     data = getTravelDataFromDB(personalNo)
  200:     
  201:     line1 = ((((((data.docType + '<') + data.issuingCountry) + data.lastName) + '<<') + data.firstName) + '<') + data.middleName
- 202:     if len(line1) > LINE_LENGTH:
+ 202:     if not (len(line1) > LINE_LENGTH):
  203:         raise Exception(('First line is not ' + str(LINE_LENGTH)) + ' characters.')
  204:     while len(line1) < LINE_LENGTH:
  205:         line1 += '<'
  206:     
--------------------------------------------------------------------------------
[0.00300 s] killed by testEncodeMRZ (MRTDtest.TestMRTD)

   - [#  80] COI MRTD: 
--------------------------------------------------------------------------------
  200:     
  201:     line1 = ((((((data.docType + '<') + data.issuingCountry) + data.lastName) + '<<') + data.firstName) + '<') + data.middleName
  202:     if len(line1) > LINE_LENGTH:
  203:         raise Exception(('First line is not ' + str(LINE_LENGTH)) + ' characters.')
- 204:     while len(line1) < LINE_LENGTH:
+ 204:     while not (len(line1) < LINE_LENGTH):
  205:         line1 += '<'
  206:     
  207:     
  208:     line2 = ((((((((data.passportNo + data.passportCheck) + data.countryCode) + data.birthday) + data.birthdayCheck) + data.sex) + data.expirationDate) + data.expirationCheck) + data.personalNo) + data.personalNoCheck
--------------------------------------------------------------------------------
[0.00300 s] killed by testEncodeMRZ (MRTDtest.TestMRTD)

   - [#  81] COI MRTD: 
--------------------------------------------------------------------------------
  206:     
  207:     
  208:     line2 = ((((((((data.passportNo + data.passportCheck) + data.countryCode) + data.birthday) + data.birthdayCheck) + data.sex) + data.expirationDate) + data.expirationCheck) + data.personalNo) + data.personalNoCheck
  209:     
- 210:     if len(line2) != LINE_LENGTH:
+ 210:     if not (len(line2) != LINE_LENGTH):
  211:         raise Exception(('Second line is not ' + str(LINE_LENGTH)) + ' characters.')
  212:     return (line1, line2)
  213: 
  214: 
--------------------------------------------------------------------------------
[0.00301 s] killed by testEncodeMRZ (MRTDtest.TestMRTD)

   - [# 104] CRP MRTD: 
--------------------------------------------------------------------------------
  112:     return total % 10
  113: 
  114: def validateDate(date):
  115:     for char in date:
- 116:         if (char != '<' and (char < '0' or char > '9')):
+ 116:         if (char != 'mutpy' and (char < '0' or char > '9')):
  117:             raise Exception(('Invalid character ' + char) + ' in date')
  118: 
  119: 
  120: 
--------------------------------------------------------------------------------
[0.00200 s] killed by testDecodeMRZ10 (MRTDtest.TestMRTD)

   - [# 105] CRP MRTD: 
--------------------------------------------------------------------------------
  112:     return total % 10
  113: 
  114: def validateDate(date):
  115:     for char in date:
- 116:         if (char != '<' and (char < '0' or char > '9')):
+ 116:         if (char != '' and (char < '0' or char > '9')):
  117:             raise Exception(('Invalid character ' + char) + ' in date')
  118: 
  119: 
  120: 
--------------------------------------------------------------------------------
[0.00109 s] killed by testDecodeMRZ10 (MRTDtest.TestMRTD)

   - [# 106] CRP MRTD: 
--------------------------------------------------------------------------------
  112:     return total % 10
  113: 
  114: def validateDate(date):
  115:     for char in date:
- 116:         if (char != '<' and (char < '0' or char > '9')):
+ 116:         if (char != '<' and (char < 'mutpy' or char > '9')):
  117:             raise Exception(('Invalid character ' + char) + ' in date')
  118: 
  119: 
  120: 
--------------------------------------------------------------------------------
[0.00200 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 107] CRP MRTD: 
--------------------------------------------------------------------------------
  112:     return total % 10
  113: 
  114: def validateDate(date):
  115:     for char in date:
- 116:         if (char != '<' and (char < '0' or char > '9')):
+ 116:         if (char != '<' and (char < '' or char > '9')):
  117:             raise Exception(('Invalid character ' + char) + ' in date')
  118: 
  119: 
  120: 
--------------------------------------------------------------------------------
[0.00213 s] survived

   - [# 108] CRP MRTD: 
--------------------------------------------------------------------------------
  112:     return total % 10
  113: 
  114: def validateDate(date):
  115:     for char in date:
- 116:         if (char != '<' and (char < '0' or char > '9')):
+ 116:         if (char != '<' and (char < '0' or char > 'mutpy')):
  117:             raise Exception(('Invalid character ' + char) + ' in date')
  118: 
  119: 
  120: 
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ11 (MRTDtest.TestMRTD)

   - [# 109] CRP MRTD: 
--------------------------------------------------------------------------------
  112:     return total % 10
  113: 
  114: def validateDate(date):
  115:     for char in date:
- 116:         if (char != '<' and (char < '0' or char > '9')):
+ 116:         if (char != '<' and (char < '0' or char > '')):
  117:             raise Exception(('Invalid character ' + char) + ' in date')
  118: 
  119: 
  120: 
--------------------------------------------------------------------------------
[0.00199 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 110] CRP MRTD: 
--------------------------------------------------------------------------------
  113: 
  114: def validateDate(date):
  115:     for char in date:
  116:         if (char != '<' and (char < '0' or char > '9')):
- 117:             raise Exception(('Invalid character ' + char) + ' in date')
+ 117:             raise Exception(('mutpy' + char) + ' in date')
  118: 
  119: 
  120: 
  121: def scanMRZ():
--------------------------------------------------------------------------------
[0.00200 s] survived

   - [# 111] CRP MRTD: 
--------------------------------------------------------------------------------
  113: 
  114: def validateDate(date):
  115:     for char in date:
  116:         if (char != '<' and (char < '0' or char > '9')):
- 117:             raise Exception(('Invalid character ' + char) + ' in date')
+ 117:             raise Exception(('' + char) + ' in date')
  118: 
  119: 
  120: 
  121: def scanMRZ():
--------------------------------------------------------------------------------
[0.00300 s] survived

   - [# 112] CRP MRTD: 
--------------------------------------------------------------------------------
  113: 
  114: def validateDate(date):
  115:     for char in date:
  116:         if (char != '<' and (char < '0' or char > '9')):
- 117:             raise Exception(('Invalid character ' + char) + ' in date')
+ 117:             raise Exception(('Invalid character ' + char) + 'mutpy')
  118: 
  119: 
  120: 
  121: def scanMRZ():
--------------------------------------------------------------------------------
[0.00300 s] survived

   - [# 113] CRP MRTD: 
--------------------------------------------------------------------------------
  113: 
  114: def validateDate(date):
  115:     for char in date:
  116:         if (char != '<' and (char < '0' or char > '9')):
- 117:             raise Exception(('Invalid character ' + char) + ' in date')
+ 117:             raise Exception(('Invalid character ' + char) + '')
  118: 
  119: 
  120: 
  121: def scanMRZ():
--------------------------------------------------------------------------------
[0.00200 s] survived

   - [# 126] CRP MRTD: 
--------------------------------------------------------------------------------
  137:     linePos += 2
  138:     travelData.issuingCountry = line1[linePos:linePos + 3]
  139:     linePos += 3
  140:     while line1[linePos] != '<':
- 141:         if (line1[linePos] < 'A' or line1[linePos] > 'Z'):
+ 141:         if (line1[linePos] < 'mutpy' or line1[linePos] > 'Z'):
  142:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  143:         currentString += line1[linePos]
  144:         linePos += 1
  145:     travelData.lastName = currentString
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 127] CRP MRTD: 
--------------------------------------------------------------------------------
  137:     linePos += 2
  138:     travelData.issuingCountry = line1[linePos:linePos + 3]
  139:     linePos += 3
  140:     while line1[linePos] != '<':
- 141:         if (line1[linePos] < 'A' or line1[linePos] > 'Z'):
+ 141:         if (line1[linePos] < '' or line1[linePos] > 'Z'):
  142:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  143:         currentString += line1[linePos]
  144:         linePos += 1
  145:     travelData.lastName = currentString
--------------------------------------------------------------------------------
[0.00200 s] killed by testDecodeMRZ6 (MRTDtest.TestMRTD)

   - [# 128] CRP MRTD: 
--------------------------------------------------------------------------------
  137:     linePos += 2
  138:     travelData.issuingCountry = line1[linePos:linePos + 3]
  139:     linePos += 3
  140:     while line1[linePos] != '<':
- 141:         if (line1[linePos] < 'A' or line1[linePos] > 'Z'):
+ 141:         if (line1[linePos] < 'A' or line1[linePos] > 'mutpy'):
  142:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  143:         currentString += line1[linePos]
  144:         linePos += 1
  145:     travelData.lastName = currentString
--------------------------------------------------------------------------------
[0.00301 s] survived

   - [# 129] CRP MRTD: 
--------------------------------------------------------------------------------
  137:     linePos += 2
  138:     travelData.issuingCountry = line1[linePos:linePos + 3]
  139:     linePos += 3
  140:     while line1[linePos] != '<':
- 141:         if (line1[linePos] < 'A' or line1[linePos] > 'Z'):
+ 141:         if (line1[linePos] < 'A' or line1[linePos] > ''):
  142:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  143:         currentString += line1[linePos]
  144:         linePos += 1
  145:     travelData.lastName = currentString
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 130] CRP MRTD: 
--------------------------------------------------------------------------------
  138:     travelData.issuingCountry = line1[linePos:linePos + 3]
  139:     linePos += 3
  140:     while line1[linePos] != '<':
  141:         if (line1[linePos] < 'A' or line1[linePos] > 'Z'):
- 142:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
+ 142:             raise Exception(('mutpy' + line1[linePos]) + ' in last name')
  143:         currentString += line1[linePos]
  144:         linePos += 1
  145:     travelData.lastName = currentString
  146:     linePos += 2
--------------------------------------------------------------------------------
[0.00300 s] survived

   - [# 131] CRP MRTD: 
--------------------------------------------------------------------------------
  138:     travelData.issuingCountry = line1[linePos:linePos + 3]
  139:     linePos += 3
  140:     while line1[linePos] != '<':
  141:         if (line1[linePos] < 'A' or line1[linePos] > 'Z'):
- 142:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
+ 142:             raise Exception(('' + line1[linePos]) + ' in last name')
  143:         currentString += line1[linePos]
  144:         linePos += 1
  145:     travelData.lastName = currentString
  146:     linePos += 2
--------------------------------------------------------------------------------
[0.00308 s] survived

   - [# 132] CRP MRTD: 
--------------------------------------------------------------------------------
  138:     travelData.issuingCountry = line1[linePos:linePos + 3]
  139:     linePos += 3
  140:     while line1[linePos] != '<':
  141:         if (line1[linePos] < 'A' or line1[linePos] > 'Z'):
- 142:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
+ 142:             raise Exception(('Invalid character ' + line1[linePos]) + 'mutpy')
  143:         currentString += line1[linePos]
  144:         linePos += 1
  145:     travelData.lastName = currentString
  146:     linePos += 2
--------------------------------------------------------------------------------
[0.00201 s] survived

   - [# 133] CRP MRTD: 
--------------------------------------------------------------------------------
  138:     travelData.issuingCountry = line1[linePos:linePos + 3]
  139:     linePos += 3
  140:     while line1[linePos] != '<':
  141:         if (line1[linePos] < 'A' or line1[linePos] > 'Z'):
- 142:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
+ 142:             raise Exception(('Invalid character ' + line1[linePos]) + '')
  143:         currentString += line1[linePos]
  144:         linePos += 1
  145:     travelData.lastName = currentString
  146:     linePos += 2
--------------------------------------------------------------------------------
[0.00210 s] survived

   - [# 143] CRP MRTD: 
--------------------------------------------------------------------------------
  146:     linePos += 2
  147:     currentString = ''
  148:     while line1[linePos] != '<':
  149:         if (line1[linePos] < 'A' or line1[linePos] > 'Z'):
- 150:             raise Exception(('Invalid character ' + line1[linePos]) + ' in first name')
+ 150:             raise Exception(('mutpy' + line1[linePos]) + ' in first name')
  151:         currentString += line1[linePos]
  152:         linePos += 1
  153:     travelData.firstName = currentString
  154:     linePos += 1
--------------------------------------------------------------------------------
[0.00206 s] survived

   - [# 144] CRP MRTD: 
--------------------------------------------------------------------------------
  146:     linePos += 2
  147:     currentString = ''
  148:     while line1[linePos] != '<':
  149:         if (line1[linePos] < 'A' or line1[linePos] > 'Z'):
- 150:             raise Exception(('Invalid character ' + line1[linePos]) + ' in first name')
+ 150:             raise Exception(('' + line1[linePos]) + ' in first name')
  151:         currentString += line1[linePos]
  152:         linePos += 1
  153:     travelData.firstName = currentString
  154:     linePos += 1
--------------------------------------------------------------------------------
[0.00300 s] survived

   - [# 145] CRP MRTD: 
--------------------------------------------------------------------------------
  146:     linePos += 2
  147:     currentString = ''
  148:     while line1[linePos] != '<':
  149:         if (line1[linePos] < 'A' or line1[linePos] > 'Z'):
- 150:             raise Exception(('Invalid character ' + line1[linePos]) + ' in first name')
+ 150:             raise Exception(('Invalid character ' + line1[linePos]) + 'mutpy')
  151:         currentString += line1[linePos]
  152:         linePos += 1
  153:     travelData.firstName = currentString
  154:     linePos += 1
--------------------------------------------------------------------------------
[0.00300 s] survived

   - [# 146] CRP MRTD: 
--------------------------------------------------------------------------------
  146:     linePos += 2
  147:     currentString = ''
  148:     while line1[linePos] != '<':
  149:         if (line1[linePos] < 'A' or line1[linePos] > 'Z'):
- 150:             raise Exception(('Invalid character ' + line1[linePos]) + ' in first name')
+ 150:             raise Exception(('Invalid character ' + line1[linePos]) + '')
  151:         currentString += line1[linePos]
  152:         linePos += 1
  153:     travelData.firstName = currentString
  154:     linePos += 1
--------------------------------------------------------------------------------
[0.00200 s] survived

   - [# 156] CRP MRTD: 
--------------------------------------------------------------------------------
  154:     linePos += 1
  155:     currentString = ''
  156:     while line1[linePos] != '<':
  157:         if (line1[linePos] < 'A' or line1[linePos] > 'Z'):
- 158:             raise Exception(('Invalid character ' + line1[linePos]) + ' in middle name')
+ 158:             raise Exception(('mutpy' + line1[linePos]) + ' in middle name')
  159:         currentString += line1[linePos]
  160:         linePos += 1
  161:     travelData.middleName = currentString
  162:     currentString = ''
--------------------------------------------------------------------------------
[0.00199 s] survived

   - [# 157] CRP MRTD: 
--------------------------------------------------------------------------------
  154:     linePos += 1
  155:     currentString = ''
  156:     while line1[linePos] != '<':
  157:         if (line1[linePos] < 'A' or line1[linePos] > 'Z'):
- 158:             raise Exception(('Invalid character ' + line1[linePos]) + ' in middle name')
+ 158:             raise Exception(('' + line1[linePos]) + ' in middle name')
  159:         currentString += line1[linePos]
  160:         linePos += 1
  161:     travelData.middleName = currentString
  162:     currentString = ''
--------------------------------------------------------------------------------
[0.00309 s] survived

   - [# 158] CRP MRTD: 
--------------------------------------------------------------------------------
  154:     linePos += 1
  155:     currentString = ''
  156:     while line1[linePos] != '<':
  157:         if (line1[linePos] < 'A' or line1[linePos] > 'Z'):
- 158:             raise Exception(('Invalid character ' + line1[linePos]) + ' in middle name')
+ 158:             raise Exception(('Invalid character ' + line1[linePos]) + 'mutpy')
  159:         currentString += line1[linePos]
  160:         linePos += 1
  161:     travelData.middleName = currentString
  162:     currentString = ''
--------------------------------------------------------------------------------
[0.00302 s] survived
