   - [# 159] CRP MRTD: 
--------------------------------------------------------------------------------
  154:     linePos += 1
  155:     currentString = ''
  156:     while line1[linePos] != '<':
  157:         if (line1[linePos] < 'A' or line1[linePos] > 'Z'):
- 158:             raise Exception(('Invalid character ' + line1[linePos]) + ' in middle name')
+ 158:             raise Exception(('Invalid character ' + line1[linePos]) + '')
  159:         currentString += line1[linePos]
  160:         linePos += 1
  161:     travelData.middleName = currentString
  162:     currentString = ''
--------------------------------------------------------------------------------
[0.00300 s] survived

   - [# 179] CRP MRTD: 
--------------------------------------------------------------------------------
  199:     data = getTravelDataFromDB(personalNo)
  200:     
  201:     line1 = ((((((data.docType + '<') + data.issuingCountry) + data.lastName) + '<<') + data.firstName) + '<') + data.middleName
  202:     if len(line1) > LINE_LENGTH:
- 203:         raise Exception(('First line is not ' + str(LINE_LENGTH)) + ' characters.')
+ 203:         raise Exception(('mutpy' + str(LINE_LENGTH)) + ' characters.')
  204:     while len(line1) < LINE_LENGTH:
  205:         line1 += '<'
  206:     
  207:     
--------------------------------------------------------------------------------
[0.00301 s] survived

   - [# 180] CRP MRTD: 
--------------------------------------------------------------------------------
  199:     data = getTravelDataFromDB(personalNo)
  200:     
  201:     line1 = ((((((data.docType + '<') + data.issuingCountry) + data.lastName) + '<<') + data.firstName) + '<') + data.middleName
  202:     if len(line1) > LINE_LENGTH:
- 203:         raise Exception(('First line is not ' + str(LINE_LENGTH)) + ' characters.')
+ 203:         raise Exception(('' + str(LINE_LENGTH)) + ' characters.')
  204:     while len(line1) < LINE_LENGTH:
  205:         line1 += '<'
  206:     
  207:     
--------------------------------------------------------------------------------
[0.01817 s] survived

   - [# 181] CRP MRTD: 
--------------------------------------------------------------------------------
  199:     data = getTravelDataFromDB(personalNo)
  200:     
  201:     line1 = ((((((data.docType + '<') + data.issuingCountry) + data.lastName) + '<<') + data.firstName) + '<') + data.middleName
  202:     if len(line1) > LINE_LENGTH:
- 203:         raise Exception(('First line is not ' + str(LINE_LENGTH)) + ' characters.')
+ 203:         raise Exception(('First line is not ' + str(LINE_LENGTH)) + 'mutpy')
  204:     while len(line1) < LINE_LENGTH:
  205:         line1 += '<'
  206:     
  207:     
--------------------------------------------------------------------------------
[0.00194 s] survived

   - [# 182] CRP MRTD: 
--------------------------------------------------------------------------------
  199:     data = getTravelDataFromDB(personalNo)
  200:     
  201:     line1 = ((((((data.docType + '<') + data.issuingCountry) + data.lastName) + '<<') + data.firstName) + '<') + data.middleName
  202:     if len(line1) > LINE_LENGTH:
- 203:         raise Exception(('First line is not ' + str(LINE_LENGTH)) + ' characters.')
+ 203:         raise Exception(('First line is not ' + str(LINE_LENGTH)) + '')
  204:     while len(line1) < LINE_LENGTH:
  205:         line1 += '<'
  206:     
  207:     
--------------------------------------------------------------------------------
[0.00200 s] survived

   - [# 185] CRP MRTD: 
--------------------------------------------------------------------------------
  207:     
  208:     line2 = ((((((((data.passportNo + data.passportCheck) + data.countryCode) + data.birthday) + data.birthdayCheck) + data.sex) + data.expirationDate) + data.expirationCheck) + data.personalNo) + data.personalNoCheck
  209:     
  210:     if len(line2) != LINE_LENGTH:
- 211:         raise Exception(('Second line is not ' + str(LINE_LENGTH)) + ' characters.')
+ 211:         raise Exception(('mutpy' + str(LINE_LENGTH)) + ' characters.')
  212:     return (line1, line2)
  213: 
  214: 
  215: 
--------------------------------------------------------------------------------
[0.00299 s] survived

   - [# 186] CRP MRTD: 
--------------------------------------------------------------------------------
  207:     
  208:     line2 = ((((((((data.passportNo + data.passportCheck) + data.countryCode) + data.birthday) + data.birthdayCheck) + data.sex) + data.expirationDate) + data.expirationCheck) + data.personalNo) + data.personalNoCheck
  209:     
  210:     if len(line2) != LINE_LENGTH:
- 211:         raise Exception(('Second line is not ' + str(LINE_LENGTH)) + ' characters.')
+ 211:         raise Exception(('' + str(LINE_LENGTH)) + ' characters.')
  212:     return (line1, line2)
  213: 
  214: 
  215: 
--------------------------------------------------------------------------------
[0.00300 s] survived

   - [# 187] CRP MRTD: 
--------------------------------------------------------------------------------
  207:     
  208:     line2 = ((((((((data.passportNo + data.passportCheck) + data.countryCode) + data.birthday) + data.birthdayCheck) + data.sex) + data.expirationDate) + data.expirationCheck) + data.personalNo) + data.personalNoCheck
  209:     
  210:     if len(line2) != LINE_LENGTH:
- 211:         raise Exception(('Second line is not ' + str(LINE_LENGTH)) + ' characters.')
+ 211:         raise Exception(('Second line is not ' + str(LINE_LENGTH)) + 'mutpy')
  212:     return (line1, line2)
  213: 
  214: 
  215: 
--------------------------------------------------------------------------------
[0.00299 s] survived

   - [# 188] CRP MRTD: 
--------------------------------------------------------------------------------
  207:     
  208:     line2 = ((((((((data.passportNo + data.passportCheck) + data.countryCode) + data.birthday) + data.birthdayCheck) + data.sex) + data.expirationDate) + data.expirationCheck) + data.personalNo) + data.personalNoCheck
  209:     
  210:     if len(line2) != LINE_LENGTH:
- 211:         raise Exception(('Second line is not ' + str(LINE_LENGTH)) + ' characters.')
+ 211:         raise Exception(('Second line is not ' + str(LINE_LENGTH)) + '')
  212:     return (line1, line2)
  213: 
  214: 
  215: 
--------------------------------------------------------------------------------
[0.00200 s] survived

   - [# 192] LCR MRTD: 
--------------------------------------------------------------------------------
  112:     return total % 10
  113: 
  114: def validateDate(date):
  115:     for char in date:
- 116:         if (char != '<' and (char < '0' or char > '9')):
+ 116:         if (char != '<' or (char < '0' or char > '9')):
  117:             raise Exception(('Invalid character ' + char) + ' in date')
  118: 
  119: 
  120: 
--------------------------------------------------------------------------------
[0.00105 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 193] LCR MRTD: 
--------------------------------------------------------------------------------
  112:     return total % 10
  113: 
  114: def validateDate(date):
  115:     for char in date:
- 116:         if (char != '<' and (char < '0' or char > '9')):
+ 116:         if (char != '<' and (char < '0' and char > '9')):
  117:             raise Exception(('Invalid character ' + char) + ' in date')
  118: 
  119: 
  120: 
--------------------------------------------------------------------------------
[0.00156 s] killed by testDecodeMRZ11 (MRTDtest.TestMRTD)

   - [# 195] LCR MRTD: 
--------------------------------------------------------------------------------
  137:     linePos += 2
  138:     travelData.issuingCountry = line1[linePos:linePos + 3]
  139:     linePos += 3
  140:     while line1[linePos] != '<':
- 141:         if (line1[linePos] < 'A' or line1[linePos] > 'Z'):
+ 141:         if (line1[linePos] < 'A' and line1[linePos] > 'Z'):
  142:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  143:         currentString += line1[linePos]
  144:         linePos += 1
  145:     travelData.lastName = currentString
--------------------------------------------------------------------------------
[0.00209 s] killed by testDecodeMRZ6 (MRTDtest.TestMRTD)

   - [# 202] ROR MRTD: 
--------------------------------------------------------------------------------
  112:     return total % 10
  113: 
  114: def validateDate(date):
  115:     for char in date:
- 116:         if (char != '<' and (char < '0' or char > '9')):
+ 116:         if (char == '<' and (char < '0' or char > '9')):
  117:             raise Exception(('Invalid character ' + char) + ' in date')
  118: 
  119: 
  120: 
--------------------------------------------------------------------------------
[0.00200 s] killed by testDecodeMRZ10 (MRTDtest.TestMRTD)

   - [# 203] ROR MRTD: 
--------------------------------------------------------------------------------
  112:     return total % 10
  113: 
  114: def validateDate(date):
  115:     for char in date:
- 116:         if (char != '<' and (char < '0' or char > '9')):
+ 116:         if (char != '<' and (char > '0' or char > '9')):
  117:             raise Exception(('Invalid character ' + char) + ' in date')
  118: 
  119: 
  120: 
--------------------------------------------------------------------------------
[0.00200 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 204] ROR MRTD: 
--------------------------------------------------------------------------------
  112:     return total % 10
  113: 
  114: def validateDate(date):
  115:     for char in date:
- 116:         if (char != '<' and (char < '0' or char > '9')):
+ 116:         if (char != '<' and (char <= '0' or char > '9')):
  117:             raise Exception(('Invalid character ' + char) + ' in date')
  118: 
  119: 
  120: 
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 205] ROR MRTD: 
--------------------------------------------------------------------------------
  112:     return total % 10
  113: 
  114: def validateDate(date):
  115:     for char in date:
- 116:         if (char != '<' and (char < '0' or char > '9')):
+ 116:         if (char != '<' and (char < '0' or char < '9')):
  117:             raise Exception(('Invalid character ' + char) + ' in date')
  118: 
  119: 
  120: 
--------------------------------------------------------------------------------
[0.00099 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 206] ROR MRTD: 
--------------------------------------------------------------------------------
  112:     return total % 10
  113: 
  114: def validateDate(date):
  115:     for char in date:
- 116:         if (char != '<' and (char < '0' or char > '9')):
+ 116:         if (char != '<' and (char < '0' or char >= '9')):
  117:             raise Exception(('Invalid character ' + char) + ' in date')
  118: 
  119: 
  120: 
--------------------------------------------------------------------------------
[0.00210 s] killed by testDecodeMRZ2 (MRTDtest.TestMRTD)

   - [# 210] ROR MRTD: 
--------------------------------------------------------------------------------
  137:     linePos += 2
  138:     travelData.issuingCountry = line1[linePos:linePos + 3]
  139:     linePos += 3
  140:     while line1[linePos] != '<':
- 141:         if (line1[linePos] < 'A' or line1[linePos] > 'Z'):
+ 141:         if (line1[linePos] > 'A' or line1[linePos] > 'Z'):
  142:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  143:         currentString += line1[linePos]
  144:         linePos += 1
  145:     travelData.lastName = currentString
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 211] ROR MRTD: 
--------------------------------------------------------------------------------
  137:     linePos += 2
  138:     travelData.issuingCountry = line1[linePos:linePos + 3]
  139:     linePos += 3
  140:     while line1[linePos] != '<':
- 141:         if (line1[linePos] < 'A' or line1[linePos] > 'Z'):
+ 141:         if (line1[linePos] <= 'A' or line1[linePos] > 'Z'):
  142:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  143:         currentString += line1[linePos]
  144:         linePos += 1
  145:     travelData.lastName = currentString
--------------------------------------------------------------------------------
[0.00200 s] killed by testDecodeMRZ3 (MRTDtest.TestMRTD)

   - [# 212] ROR MRTD: 
--------------------------------------------------------------------------------
  137:     linePos += 2
  138:     travelData.issuingCountry = line1[linePos:linePos + 3]
  139:     linePos += 3
  140:     while line1[linePos] != '<':
- 141:         if (line1[linePos] < 'A' or line1[linePos] > 'Z'):
+ 141:         if (line1[linePos] < 'A' or line1[linePos] < 'Z'):
  142:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  143:         currentString += line1[linePos]
  144:         linePos += 1
  145:     travelData.lastName = currentString
--------------------------------------------------------------------------------
[0.00099 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 213] ROR MRTD: 
--------------------------------------------------------------------------------
  137:     linePos += 2
  138:     travelData.issuingCountry = line1[linePos:linePos + 3]
  139:     linePos += 3
  140:     while line1[linePos] != '<':
- 141:         if (line1[linePos] < 'A' or line1[linePos] > 'Z'):
+ 141:         if (line1[linePos] < 'A' or line1[linePos] >= 'Z'):
  142:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  143:         currentString += line1[linePos]
  144:         linePos += 1
  145:     travelData.lastName = currentString
--------------------------------------------------------------------------------
[0.00194 s] survived

   - [# 224] ROR MRTD: 
--------------------------------------------------------------------------------
  198: def encodeMRZ(personalNo):
  199:     data = getTravelDataFromDB(personalNo)
  200:     
  201:     line1 = ((((((data.docType + '<') + data.issuingCountry) + data.lastName) + '<<') + data.firstName) + '<') + data.middleName
- 202:     if len(line1) > LINE_LENGTH:
+ 202:     if len(line1) < LINE_LENGTH:
  203:         raise Exception(('First line is not ' + str(LINE_LENGTH)) + ' characters.')
  204:     while len(line1) < LINE_LENGTH:
  205:         line1 += '<'
  206:     
--------------------------------------------------------------------------------
[0.00200 s] killed by testEncodeMRZ (MRTDtest.TestMRTD)

   - [# 225] ROR MRTD: 
--------------------------------------------------------------------------------
  198: def encodeMRZ(personalNo):
  199:     data = getTravelDataFromDB(personalNo)
  200:     
  201:     line1 = ((((((data.docType + '<') + data.issuingCountry) + data.lastName) + '<<') + data.firstName) + '<') + data.middleName
- 202:     if len(line1) > LINE_LENGTH:
+ 202:     if len(line1) >= LINE_LENGTH:
  203:         raise Exception(('First line is not ' + str(LINE_LENGTH)) + ' characters.')
  204:     while len(line1) < LINE_LENGTH:
  205:         line1 += '<'
  206:     
--------------------------------------------------------------------------------
[0.00300 s] survived

   - [# 226] ROR MRTD: 
--------------------------------------------------------------------------------
  200:     
  201:     line1 = ((((((data.docType + '<') + data.issuingCountry) + data.lastName) + '<<') + data.firstName) + '<') + data.middleName
  202:     if len(line1) > LINE_LENGTH:
  203:         raise Exception(('First line is not ' + str(LINE_LENGTH)) + ' characters.')
- 204:     while len(line1) < LINE_LENGTH:
+ 204:     while len(line1) > LINE_LENGTH:
  205:         line1 += '<'
  206:     
  207:     
  208:     line2 = ((((((((data.passportNo + data.passportCheck) + data.countryCode) + data.birthday) + data.birthdayCheck) + data.sex) + data.expirationDate) + data.expirationCheck) + data.personalNo) + data.personalNoCheck
--------------------------------------------------------------------------------
[0.00299 s] killed by testEncodeMRZ (MRTDtest.TestMRTD)

   - [# 227] ROR MRTD: 
--------------------------------------------------------------------------------
  200:     
  201:     line1 = ((((((data.docType + '<') + data.issuingCountry) + data.lastName) + '<<') + data.firstName) + '<') + data.middleName
  202:     if len(line1) > LINE_LENGTH:
  203:         raise Exception(('First line is not ' + str(LINE_LENGTH)) + ' characters.')
- 204:     while len(line1) < LINE_LENGTH:
+ 204:     while len(line1) <= LINE_LENGTH:
  205:         line1 += '<'
  206:     
  207:     
  208:     line2 = ((((((((data.passportNo + data.passportCheck) + data.countryCode) + data.birthday) + data.birthdayCheck) + data.sex) + data.expirationDate) + data.expirationCheck) + data.personalNo) + data.personalNoCheck
--------------------------------------------------------------------------------
[0.00300 s] killed by testEncodeMRZ (MRTDtest.TestMRTD)

   - [# 228] ROR MRTD: 
--------------------------------------------------------------------------------
  206:     
  207:     
  208:     line2 = ((((((((data.passportNo + data.passportCheck) + data.countryCode) + data.birthday) + data.birthdayCheck) + data.sex) + data.expirationDate) + data.expirationCheck) + data.personalNo) + data.personalNoCheck
  209:     
- 210:     if len(line2) != LINE_LENGTH:
+ 210:     if len(line2) == LINE_LENGTH:
  211:         raise Exception(('Second line is not ' + str(LINE_LENGTH)) + ' characters.')
  212:     return (line1, line2)
  213: 
  214: 
--------------------------------------------------------------------------------
[0.00300 s] killed by testEncodeMRZ (MRTDtest.TestMRTD)
