   - [#   1] AOR MRTD: 
--------------------------------------------------------------------------------
   95:         int(i)
   96:         return int(i)
   97:     except ValueError:
   98:         if (str(i) >= 'A' and str(i) <= 'Z'):
-  99:             return int(ord(str(i)) - 55)
+  99:             return int(ord(str(i)) + 55)
  100:         else:
  101:             return 0
  102: 
  103: def calculateCheck(lst):
--------------------------------------------------------------------------------
[0.00199 s] killed by testGetNumericalValue (MRTDtest.TestMRTD)

   - [#   2] AOR MRTD: 
--------------------------------------------------------------------------------
  106:     total = 0
  107:     
  108:     for i in lst:
  109:         numVal = getNumericalValue(i)
- 110:         total += numVal * weights[weightIdx]
+ 110:         total += numVal / weights[weightIdx]
  111:         weightIdx = (weightIdx + 1) % len(weights)
  112:     return total % 10
  113: 
  114: 
--------------------------------------------------------------------------------
[0.00000 s] killed by testCalculateCheck (MRTDtest.TestMRTD)

   - [#   3] AOR MRTD: 
--------------------------------------------------------------------------------
  106:     total = 0
  107:     
  108:     for i in lst:
  109:         numVal = getNumericalValue(i)
- 110:         total += numVal * weights[weightIdx]
+ 110:         total += numVal // weights[weightIdx]
  111:         weightIdx = (weightIdx + 1) % len(weights)
  112:     return total % 10
  113: 
  114: 
--------------------------------------------------------------------------------
[0.00100 s] killed by testCalculateCheck (MRTDtest.TestMRTD)

   - [#   4] AOR MRTD: 
--------------------------------------------------------------------------------
  106:     total = 0
  107:     
  108:     for i in lst:
  109:         numVal = getNumericalValue(i)
- 110:         total += numVal * weights[weightIdx]
+ 110:         total += numVal ** weights[weightIdx]
  111:         weightIdx = (weightIdx + 1) % len(weights)
  112:     return total % 10
  113: 
  114: 
--------------------------------------------------------------------------------
[0.00163 s] killed by testCalculateCheck (MRTDtest.TestMRTD)

   - [#   5] AOR MRTD: 
--------------------------------------------------------------------------------
  107:     
  108:     for i in lst:
  109:         numVal = getNumericalValue(i)
  110:         total += numVal * weights[weightIdx]
- 111:         weightIdx = (weightIdx + 1) % len(weights)
+ 111:         weightIdx = (weightIdx - 1) % len(weights)
  112:     return total % 10
  113: 
  114: 
  115: 
--------------------------------------------------------------------------------
[0.00000 s] killed by testCalculateCheck (MRTDtest.TestMRTD)

   - [#   6] AOR MRTD: 
--------------------------------------------------------------------------------
  107:     
  108:     for i in lst:
  109:         numVal = getNumericalValue(i)
  110:         total += numVal * weights[weightIdx]
- 111:         weightIdx = (weightIdx + 1) % len(weights)
+ 111:         weightIdx = (weightIdx + 1) * len(weights)
  112:     return total % 10
  113: 
  114: 
  115: 
--------------------------------------------------------------------------------
[0.00100 s] killed by testCalculateCheck (MRTDtest.TestMRTD)

   - [#   7] AOR MRTD: 
--------------------------------------------------------------------------------
  108:     for i in lst:
  109:         numVal = getNumericalValue(i)
  110:         total += numVal * weights[weightIdx]
  111:         weightIdx = (weightIdx + 1) % len(weights)
- 112:     return total % 10
+ 112:     return total * 10
  113: 
  114: 
  115: 
  116: def scanMRZ():
--------------------------------------------------------------------------------
[0.00101 s] killed by testCalculateCheck (MRTDtest.TestMRTD)

   - [#   8] AOR MRTD: 
--------------------------------------------------------------------------------
  123: def decodeMRZ():
  124:     
  125:     (line1, line2) = scanMRZ()
  126:     if (len(line1) != LINE_LENGTH or len(line2) != LINE_LENGTH):
- 127:         raise Exception(('Lines must both be ' + str(LINE_LENGTH)) + ' characters.')
+ 127:         raise Exception(('Lines must both be ' - str(LINE_LENGTH)) + ' characters.')
  128:     travelData = TravelData()
  129:     linePos = 0
  130:     
  131:     currentString = ''
--------------------------------------------------------------------------------
[0.00237 s] survived

   - [#   9] AOR MRTD: 
--------------------------------------------------------------------------------
  123: def decodeMRZ():
  124:     
  125:     (line1, line2) = scanMRZ()
  126:     if (len(line1) != LINE_LENGTH or len(line2) != LINE_LENGTH):
- 127:         raise Exception(('Lines must both be ' + str(LINE_LENGTH)) + ' characters.')
+ 127:         raise Exception(('Lines must both be ' + str(LINE_LENGTH)) - ' characters.')
  128:     travelData = TravelData()
  129:     linePos = 0
  130:     
  131:     currentString = ''
--------------------------------------------------------------------------------
[0.00100 s] survived

   - [#  10] AOR MRTD: 
--------------------------------------------------------------------------------
  128:     travelData = TravelData()
  129:     linePos = 0
  130:     
  131:     currentString = ''
- 132:     travelData.docType = line1[linePos:linePos + 1]
+ 132:     travelData.docType = line1[linePos:linePos - 1]
  133:     linePos += 2
  134:     travelData.issuingCountry = line1[linePos:linePos + 3]
  135:     linePos += 3
  136:     while line1[linePos] != '<':
--------------------------------------------------------------------------------
[0.00819 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  11] AOR MRTD: 
--------------------------------------------------------------------------------
  130:     
  131:     currentString = ''
  132:     travelData.docType = line1[linePos:linePos + 1]
  133:     linePos += 2
- 134:     travelData.issuingCountry = line1[linePos:linePos + 3]
+ 134:     travelData.issuingCountry = line1[linePos:linePos - 3]
  135:     linePos += 3
  136:     while line1[linePos] != '<':
  137:         currentString += line1[linePos]
  138:         linePos += 1
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  12] AOR MRTD: 
--------------------------------------------------------------------------------
  155:     
  156:     linePos = 0
  157:     travelData.passportNo = line2[linePos:PASSPORT_LENGTH]
  158:     linePos += PASSPORT_LENGTH
- 159:     travelData.passportCheck = line2[linePos:linePos + 1]
+ 159:     travelData.passportCheck = line2[linePos:linePos - 1]
  160:     linePos += 1
  161:     travelData.countryCode = line2[linePos:linePos + COUNTRY_CODE_LENGTH]
  162:     linePos += COUNTRY_CODE_LENGTH
  163:     travelData.birthday = line2[linePos:linePos + DATE_LENGTH]
--------------------------------------------------------------------------------
[0.00099 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  13] AOR MRTD: 
--------------------------------------------------------------------------------
  157:     travelData.passportNo = line2[linePos:PASSPORT_LENGTH]
  158:     linePos += PASSPORT_LENGTH
  159:     travelData.passportCheck = line2[linePos:linePos + 1]
  160:     linePos += 1
- 161:     travelData.countryCode = line2[linePos:linePos + COUNTRY_CODE_LENGTH]
+ 161:     travelData.countryCode = line2[linePos:linePos - COUNTRY_CODE_LENGTH]
  162:     linePos += COUNTRY_CODE_LENGTH
  163:     travelData.birthday = line2[linePos:linePos + DATE_LENGTH]
  164:     linePos += DATE_LENGTH
  165:     travelData.birthdayCheck = line2[linePos:linePos + 1]
--------------------------------------------------------------------------------
[0.00099 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  14] AOR MRTD: 
--------------------------------------------------------------------------------
  159:     travelData.passportCheck = line2[linePos:linePos + 1]
  160:     linePos += 1
  161:     travelData.countryCode = line2[linePos:linePos + COUNTRY_CODE_LENGTH]
  162:     linePos += COUNTRY_CODE_LENGTH
- 163:     travelData.birthday = line2[linePos:linePos + DATE_LENGTH]
+ 163:     travelData.birthday = line2[linePos:linePos - DATE_LENGTH]
  164:     linePos += DATE_LENGTH
  165:     travelData.birthdayCheck = line2[linePos:linePos + 1]
  166:     linePos += 1
  167:     travelData.sex = line2[linePos:linePos + SEX_LENGTH]
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  15] AOR MRTD: 
--------------------------------------------------------------------------------
  161:     travelData.countryCode = line2[linePos:linePos + COUNTRY_CODE_LENGTH]
  162:     linePos += COUNTRY_CODE_LENGTH
  163:     travelData.birthday = line2[linePos:linePos + DATE_LENGTH]
  164:     linePos += DATE_LENGTH
- 165:     travelData.birthdayCheck = line2[linePos:linePos + 1]
+ 165:     travelData.birthdayCheck = line2[linePos:linePos - 1]
  166:     linePos += 1
  167:     travelData.sex = line2[linePos:linePos + SEX_LENGTH]
  168:     linePos += 1
  169:     travelData.expirationDate = line2[linePos:linePos + DATE_LENGTH]
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  16] AOR MRTD: 
--------------------------------------------------------------------------------
  163:     travelData.birthday = line2[linePos:linePos + DATE_LENGTH]
  164:     linePos += DATE_LENGTH
  165:     travelData.birthdayCheck = line2[linePos:linePos + 1]
  166:     linePos += 1
- 167:     travelData.sex = line2[linePos:linePos + SEX_LENGTH]
+ 167:     travelData.sex = line2[linePos:linePos - SEX_LENGTH]
  168:     linePos += 1
  169:     travelData.expirationDate = line2[linePos:linePos + DATE_LENGTH]
  170:     linePos += DATE_LENGTH
  171:     travelData.expirationCheck = line2[linePos:linePos + 1]
--------------------------------------------------------------------------------
[0.00111 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  17] AOR MRTD: 
--------------------------------------------------------------------------------
  165:     travelData.birthdayCheck = line2[linePos:linePos + 1]
  166:     linePos += 1
  167:     travelData.sex = line2[linePos:linePos + SEX_LENGTH]
  168:     linePos += 1
- 169:     travelData.expirationDate = line2[linePos:linePos + DATE_LENGTH]
+ 169:     travelData.expirationDate = line2[linePos:linePos - DATE_LENGTH]
  170:     linePos += DATE_LENGTH
  171:     travelData.expirationCheck = line2[linePos:linePos + 1]
  172:     linePos += 1
  173:     travelData.personalNo = line2[linePos:len(line2) - 1]
--------------------------------------------------------------------------------
[0.00101 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  18] AOR MRTD: 
--------------------------------------------------------------------------------
  167:     travelData.sex = line2[linePos:linePos + SEX_LENGTH]
  168:     linePos += 1
  169:     travelData.expirationDate = line2[linePos:linePos + DATE_LENGTH]
  170:     linePos += DATE_LENGTH
- 171:     travelData.expirationCheck = line2[linePos:linePos + 1]
+ 171:     travelData.expirationCheck = line2[linePos:linePos - 1]
  172:     linePos += 1
  173:     travelData.personalNo = line2[linePos:len(line2) - 1]
  174:     linePos = len(line2) - 1
  175:     travelData.personalNoCheck = line2[linePos]
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  19] AOR MRTD: 
--------------------------------------------------------------------------------
  169:     travelData.expirationDate = line2[linePos:linePos + DATE_LENGTH]
  170:     linePos += DATE_LENGTH
  171:     travelData.expirationCheck = line2[linePos:linePos + 1]
  172:     linePos += 1
- 173:     travelData.personalNo = line2[linePos:len(line2) - 1]
+ 173:     travelData.personalNo = line2[linePos:len(line2) + 1]
  174:     linePos = len(line2) - 1
  175:     travelData.personalNoCheck = line2[linePos]
  176:     linePos += 1
  177:     return travelData
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  20] AOR MRTD: 
--------------------------------------------------------------------------------
  170:     linePos += DATE_LENGTH
  171:     travelData.expirationCheck = line2[linePos:linePos + 1]
  172:     linePos += 1
  173:     travelData.personalNo = line2[linePos:len(line2) - 1]
- 174:     linePos = len(line2) - 1
+ 174:     linePos = len(line2) + 1
  175:     travelData.personalNoCheck = line2[linePos]
  176:     linePos += 1
  177:     return travelData
  178: 
--------------------------------------------------------------------------------
[0.00096 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  37] ASR MRTD: 
--------------------------------------------------------------------------------
  106:     total = 0
  107:     
  108:     for i in lst:
  109:         numVal = getNumericalValue(i)
- 110:         total += numVal * weights[weightIdx]
+ 110:         total -= numVal * weights[weightIdx]
  111:         weightIdx = (weightIdx + 1) % len(weights)
  112:     return total % 10
  113: 
  114: 
--------------------------------------------------------------------------------
[0.00099 s] killed by testCalculateCheck (MRTDtest.TestMRTD)

   - [#  38] ASR MRTD: 
--------------------------------------------------------------------------------
  129:     linePos = 0
  130:     
  131:     currentString = ''
  132:     travelData.docType = line1[linePos:linePos + 1]
- 133:     linePos += 2
+ 133:     linePos -= 2
  134:     travelData.issuingCountry = line1[linePos:linePos + 3]
  135:     linePos += 3
  136:     while line1[linePos] != '<':
  137:         currentString += line1[linePos]
--------------------------------------------------------------------------------
[0.00099 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  39] ASR MRTD: 
--------------------------------------------------------------------------------
  131:     currentString = ''
  132:     travelData.docType = line1[linePos:linePos + 1]
  133:     linePos += 2
  134:     travelData.issuingCountry = line1[linePos:linePos + 3]
- 135:     linePos += 3
+ 135:     linePos -= 3
  136:     while line1[linePos] != '<':
  137:         currentString += line1[linePos]
  138:         linePos += 1
  139:     travelData.lastName = currentString
--------------------------------------------------------------------------------
[0.00099 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  41] ASR MRTD: 
--------------------------------------------------------------------------------
  134:     travelData.issuingCountry = line1[linePos:linePos + 3]
  135:     linePos += 3
  136:     while line1[linePos] != '<':
  137:         currentString += line1[linePos]
- 138:         linePos += 1
+ 138:         linePos -= 1
  139:     travelData.lastName = currentString
  140:     linePos += 2
  141:     currentString = ''
  142:     while line1[linePos] != '<':
--------------------------------------------------------------------------------
[0.00099 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  42] ASR MRTD: 
--------------------------------------------------------------------------------
  136:     while line1[linePos] != '<':
  137:         currentString += line1[linePos]
  138:         linePos += 1
  139:     travelData.lastName = currentString
- 140:     linePos += 2
+ 140:     linePos -= 2
  141:     currentString = ''
  142:     while line1[linePos] != '<':
  143:         currentString += line1[linePos]
  144:         linePos += 1
--------------------------------------------------------------------------------
[0.00099 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  45] ASR MRTD: 
--------------------------------------------------------------------------------
  142:     while line1[linePos] != '<':
  143:         currentString += line1[linePos]
  144:         linePos += 1
  145:     travelData.firstName = currentString
- 146:     linePos += 1
+ 146:     linePos -= 1
  147:     currentString = ''
  148:     while line1[linePos] != '<':
  149:         currentString += line1[linePos]
  150:         linePos += 1
--------------------------------------------------------------------------------
[0.00099 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  48] ASR MRTD: 
--------------------------------------------------------------------------------
  154:     
  155:     
  156:     linePos = 0
  157:     travelData.passportNo = line2[linePos:PASSPORT_LENGTH]
- 158:     linePos += PASSPORT_LENGTH
+ 158:     linePos -= PASSPORT_LENGTH
  159:     travelData.passportCheck = line2[linePos:linePos + 1]
  160:     linePos += 1
  161:     travelData.countryCode = line2[linePos:linePos + COUNTRY_CODE_LENGTH]
  162:     linePos += COUNTRY_CODE_LENGTH
--------------------------------------------------------------------------------
[0.00102 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  49] ASR MRTD: 
--------------------------------------------------------------------------------
  156:     linePos = 0
  157:     travelData.passportNo = line2[linePos:PASSPORT_LENGTH]
  158:     linePos += PASSPORT_LENGTH
  159:     travelData.passportCheck = line2[linePos:linePos + 1]
- 160:     linePos += 1
+ 160:     linePos -= 1
  161:     travelData.countryCode = line2[linePos:linePos + COUNTRY_CODE_LENGTH]
  162:     linePos += COUNTRY_CODE_LENGTH
  163:     travelData.birthday = line2[linePos:linePos + DATE_LENGTH]
  164:     linePos += DATE_LENGTH
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  50] ASR MRTD: 
--------------------------------------------------------------------------------
  158:     linePos += PASSPORT_LENGTH
  159:     travelData.passportCheck = line2[linePos:linePos + 1]
  160:     linePos += 1
  161:     travelData.countryCode = line2[linePos:linePos + COUNTRY_CODE_LENGTH]
- 162:     linePos += COUNTRY_CODE_LENGTH
+ 162:     linePos -= COUNTRY_CODE_LENGTH
  163:     travelData.birthday = line2[linePos:linePos + DATE_LENGTH]
  164:     linePos += DATE_LENGTH
  165:     travelData.birthdayCheck = line2[linePos:linePos + 1]
  166:     linePos += 1
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  51] ASR MRTD: 
--------------------------------------------------------------------------------
  160:     linePos += 1
  161:     travelData.countryCode = line2[linePos:linePos + COUNTRY_CODE_LENGTH]
  162:     linePos += COUNTRY_CODE_LENGTH
  163:     travelData.birthday = line2[linePos:linePos + DATE_LENGTH]
- 164:     linePos += DATE_LENGTH
+ 164:     linePos -= DATE_LENGTH
  165:     travelData.birthdayCheck = line2[linePos:linePos + 1]
  166:     linePos += 1
  167:     travelData.sex = line2[linePos:linePos + SEX_LENGTH]
  168:     linePos += 1
--------------------------------------------------------------------------------
[0.00199 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  52] ASR MRTD: 
--------------------------------------------------------------------------------
  162:     linePos += COUNTRY_CODE_LENGTH
  163:     travelData.birthday = line2[linePos:linePos + DATE_LENGTH]
  164:     linePos += DATE_LENGTH
  165:     travelData.birthdayCheck = line2[linePos:linePos + 1]
- 166:     linePos += 1
+ 166:     linePos -= 1
  167:     travelData.sex = line2[linePos:linePos + SEX_LENGTH]
  168:     linePos += 1
  169:     travelData.expirationDate = line2[linePos:linePos + DATE_LENGTH]
  170:     linePos += DATE_LENGTH
--------------------------------------------------------------------------------
[0.00128 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  53] ASR MRTD: 
--------------------------------------------------------------------------------
  164:     linePos += DATE_LENGTH
  165:     travelData.birthdayCheck = line2[linePos:linePos + 1]
  166:     linePos += 1
  167:     travelData.sex = line2[linePos:linePos + SEX_LENGTH]
- 168:     linePos += 1
+ 168:     linePos -= 1
  169:     travelData.expirationDate = line2[linePos:linePos + DATE_LENGTH]
  170:     linePos += DATE_LENGTH
  171:     travelData.expirationCheck = line2[linePos:linePos + 1]
  172:     linePos += 1
--------------------------------------------------------------------------------
[0.00099 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  54] ASR MRTD: 
--------------------------------------------------------------------------------
  166:     linePos += 1
  167:     travelData.sex = line2[linePos:linePos + SEX_LENGTH]
  168:     linePos += 1
  169:     travelData.expirationDate = line2[linePos:linePos + DATE_LENGTH]
- 170:     linePos += DATE_LENGTH
+ 170:     linePos -= DATE_LENGTH
  171:     travelData.expirationCheck = line2[linePos:linePos + 1]
  172:     linePos += 1
  173:     travelData.personalNo = line2[linePos:len(line2) - 1]
  174:     linePos = len(line2) - 1
--------------------------------------------------------------------------------
[0.00099 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  55] ASR MRTD: 
--------------------------------------------------------------------------------
  168:     linePos += 1
  169:     travelData.expirationDate = line2[linePos:linePos + DATE_LENGTH]
  170:     linePos += DATE_LENGTH
  171:     travelData.expirationCheck = line2[linePos:linePos + 1]
- 172:     linePos += 1
+ 172:     linePos -= 1
  173:     travelData.personalNo = line2[linePos:len(line2) - 1]
  174:     linePos = len(line2) - 1
  175:     travelData.personalNoCheck = line2[linePos]
  176:     linePos += 1
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  56] ASR MRTD: 
--------------------------------------------------------------------------------
  172:     linePos += 1
  173:     travelData.personalNo = line2[linePos:len(line2) - 1]
  174:     linePos = len(line2) - 1
  175:     travelData.personalNoCheck = line2[linePos]
- 176:     linePos += 1
+ 176:     linePos -= 1
  177:     return travelData
  178: 
  179: 
  180: 
--------------------------------------------------------------------------------
[0.00100 s] survived

   - [#  58] COI MRTD: 
--------------------------------------------------------------------------------
   94:     try:
   95:         int(i)
   96:         return int(i)
   97:     except ValueError:
-  98:         if (str(i) >= 'A' and str(i) <= 'Z'):
+  98:         if not ((str(i) >= 'A' and str(i) <= 'Z')):
   99:             return int(ord(str(i)) - 55)
  100:         else:
  101:             return 0
  102: 
--------------------------------------------------------------------------------
[0.00000 s] killed by testCalculateCheck (MRTDtest.TestMRTD)

   - [#  59] COI MRTD: 
--------------------------------------------------------------------------------
  122: 
  123: def decodeMRZ():
  124:     
  125:     (line1, line2) = scanMRZ()
- 126:     if (len(line1) != LINE_LENGTH or len(line2) != LINE_LENGTH):
+ 126:     if not ((len(line1) != LINE_LENGTH or len(line2) != LINE_LENGTH)):
  127:         raise Exception(('Lines must both be ' + str(LINE_LENGTH)) + ' characters.')
  128:     travelData = TravelData()
  129:     linePos = 0
  130:     
--------------------------------------------------------------------------------
[0.00099 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  60] COI MRTD: 
--------------------------------------------------------------------------------
  132:     travelData.docType = line1[linePos:linePos + 1]
  133:     linePos += 2
  134:     travelData.issuingCountry = line1[linePos:linePos + 3]
  135:     linePos += 3
- 136:     while line1[linePos] != '<':
+ 136:     while not (line1[linePos] != '<'):
  137:         currentString += line1[linePos]
  138:         linePos += 1
  139:     travelData.lastName = currentString
  140:     linePos += 2
--------------------------------------------------------------------------------
[0.00099 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  61] COI MRTD: 
--------------------------------------------------------------------------------
  138:         linePos += 1
  139:     travelData.lastName = currentString
  140:     linePos += 2
  141:     currentString = ''
- 142:     while line1[linePos] != '<':
+ 142:     while not (line1[linePos] != '<'):
  143:         currentString += line1[linePos]
  144:         linePos += 1
  145:     travelData.firstName = currentString
  146:     linePos += 1
--------------------------------------------------------------------------------
[0.00101 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  63] COI MRTD: 
--------------------------------------------------------------------------------
  186: def encodeMRZ(personalNo):
  187:     data = getTravelDataFromDB(personalNo)
  188:     
  189:     line1 = ((((((data.docType + '<') + data.issuingCountry) + data.lastName) + '<<') + data.firstName) + '<') + data.middleName
- 190:     while len(line1) < LINE_LENGTH:
+ 190:     while not (len(line1) < LINE_LENGTH):
  191:         line1 += '<'
  192:     
  193:     
  194:     line2 = ((((((((data.passportNo + data.passportCheck) + data.countryCode) + data.birthday) + data.birthdayCheck) + data.sex) + data.expirationDate) + data.expirationCheck) + data.personalNo) + data.personalNoCheck
--------------------------------------------------------------------------------
[0.00200 s] killed by testEncodeMRZ (MRTDtest.TestMRTD)

   - [#  64] COI MRTD: 
--------------------------------------------------------------------------------
  199: 
  200: def checkMismatches(travelData):
  201:     
  202:     errors = TravelDataError()
- 203:     if int(travelData.passportCheck) != calculateCheck(travelData.passportNo):
+ 203:     if not (int(travelData.passportCheck) != calculateCheck(travelData.passportNo)):
  204:         errors.passportError = True
  205:     else:
  206:         errors.passportError = False
  207:     
--------------------------------------------------------------------------------
[0.00101 s] killed by testCheckMismatches (MRTDtest.TestMRTD)

   - [#  65] COI MRTD: 
--------------------------------------------------------------------------------
  204:         errors.passportError = True
  205:     else:
  206:         errors.passportError = False
  207:     
- 208:     if int(travelData.birthdayCheck) != calculateCheck(travelData.birthday):
+ 208:     if not (int(travelData.birthdayCheck) != calculateCheck(travelData.birthday)):
  209:         errors.birthdayError = True
  210:     else:
  211:         errors.birthdayError = False
  212:     
--------------------------------------------------------------------------------
[0.00100 s] killed by testCheckMismatches (MRTDtest.TestMRTD)

   - [#  66] COI MRTD: 
--------------------------------------------------------------------------------
  209:         errors.birthdayError = True
  210:     else:
  211:         errors.birthdayError = False
  212:     
- 213:     if int(travelData.expirationCheck) != calculateCheck(travelData.expirationDate):
+ 213:     if not (int(travelData.expirationCheck) != calculateCheck(travelData.expirationDate)):
  214:         errors.expirationError = True
  215:     else:
  216:         errors.expirationError = False
  217:     
--------------------------------------------------------------------------------
[0.00101 s] killed by testCheckMismatches (MRTDtest.TestMRTD)

   - [#  67] COI MRTD: 
--------------------------------------------------------------------------------
  214:         errors.expirationError = True
  215:     else:
  216:         errors.expirationError = False
  217:     
- 218:     if int(travelData.personalNoCheck) != calculateCheck(travelData.personalNo):
+ 218:     if not (int(travelData.personalNoCheck) != calculateCheck(travelData.personalNo)):
  219:         errors.personalError = True
  220:     else:
  221:         errors.personalError = False
  222:     return errors
--------------------------------------------------------------------------------
[0.00100 s] killed by testCheckMismatches (MRTDtest.TestMRTD)

   - [#  68] CRP MRTD: 
--------------------------------------------------------------------------------
-   1: PASSPORT_LENGTH = 9
+   1: PASSPORT_LENGTH = 10
    2: COUNTRY_CODE_LENGTH = 3
    3: DATE_LENGTH = 6
    4: SEX_LENGTH = 1
    5: LINE_LENGTH = 44
--------------------------------------------------------------------------------
[0.00153 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  69] CRP MRTD: 
--------------------------------------------------------------------------------
    1: PASSPORT_LENGTH = 9
-   2: COUNTRY_CODE_LENGTH = 3
+   2: COUNTRY_CODE_LENGTH = 4
    3: DATE_LENGTH = 6
    4: SEX_LENGTH = 1
    5: LINE_LENGTH = 44
    6: 
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  70] CRP MRTD: 
--------------------------------------------------------------------------------
    1: PASSPORT_LENGTH = 9
    2: COUNTRY_CODE_LENGTH = 3
-   3: DATE_LENGTH = 6
+   3: DATE_LENGTH = 7
    4: SEX_LENGTH = 1
    5: LINE_LENGTH = 44
    6: 
    7: 
--------------------------------------------------------------------------------
[0.00101 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)
