   - [#  71] CRP MRTD: 
--------------------------------------------------------------------------------
    1: PASSPORT_LENGTH = 9
    2: COUNTRY_CODE_LENGTH = 3
    3: DATE_LENGTH = 6
-   4: SEX_LENGTH = 1
+   4: SEX_LENGTH = 2
    5: LINE_LENGTH = 44
    6: 
    7: 
    8: 
--------------------------------------------------------------------------------
[0.00101 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  72] CRP MRTD: 
--------------------------------------------------------------------------------
    1: PASSPORT_LENGTH = 9
    2: COUNTRY_CODE_LENGTH = 3
    3: DATE_LENGTH = 6
    4: SEX_LENGTH = 1
-   5: LINE_LENGTH = 44
+   5: LINE_LENGTH = 45
    6: 
    7: 
    8: 
    9: class TravelData:
--------------------------------------------------------------------------------
[0.00200 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  73] CRP MRTD: 
--------------------------------------------------------------------------------
   94:     try:
   95:         int(i)
   96:         return int(i)
   97:     except ValueError:
-  98:         if (str(i) >= 'A' and str(i) <= 'Z'):
+  98:         if (str(i) >= 'mutpy' and str(i) <= 'Z'):
   99:             return int(ord(str(i)) - 55)
  100:         else:
  101:             return 0
  102: 
--------------------------------------------------------------------------------
[0.00073 s] killed by testCalculateCheck (MRTDtest.TestMRTD)

   - [#  74] CRP MRTD: 
--------------------------------------------------------------------------------
   94:     try:
   95:         int(i)
   96:         return int(i)
   97:     except ValueError:
-  98:         if (str(i) >= 'A' and str(i) <= 'Z'):
+  98:         if (str(i) >= '' and str(i) <= 'Z'):
   99:             return int(ord(str(i)) - 55)
  100:         else:
  101:             return 0
  102: 
--------------------------------------------------------------------------------
[0.00000 s] killed by testCalculateCheck (MRTDtest.TestMRTD)

   - [#  75] CRP MRTD: 
--------------------------------------------------------------------------------
   94:     try:
   95:         int(i)
   96:         return int(i)
   97:     except ValueError:
-  98:         if (str(i) >= 'A' and str(i) <= 'Z'):
+  98:         if (str(i) >= 'A' and str(i) <= 'mutpy'):
   99:             return int(ord(str(i)) - 55)
  100:         else:
  101:             return 0
  102: 
--------------------------------------------------------------------------------
[0.00201 s] survived

   - [#  76] CRP MRTD: 
--------------------------------------------------------------------------------
   94:     try:
   95:         int(i)
   96:         return int(i)
   97:     except ValueError:
-  98:         if (str(i) >= 'A' and str(i) <= 'Z'):
+  98:         if (str(i) >= 'A' and str(i) <= ''):
   99:             return int(ord(str(i)) - 55)
  100:         else:
  101:             return 0
  102: 
--------------------------------------------------------------------------------
[0.00100 s] killed by testCalculateCheck (MRTDtest.TestMRTD)

   - [#  77] CRP MRTD: 
--------------------------------------------------------------------------------
   95:         int(i)
   96:         return int(i)
   97:     except ValueError:
   98:         if (str(i) >= 'A' and str(i) <= 'Z'):
-  99:             return int(ord(str(i)) - 55)
+  99:             return int(ord(str(i)) - 56)
  100:         else:
  101:             return 0
  102: 
  103: def calculateCheck(lst):
--------------------------------------------------------------------------------
[0.00099 s] killed by testCalculateCheck (MRTDtest.TestMRTD)

   - [#  78] CRP MRTD: 
--------------------------------------------------------------------------------
   97:     except ValueError:
   98:         if (str(i) >= 'A' and str(i) <= 'Z'):
   99:             return int(ord(str(i)) - 55)
  100:         else:
- 101:             return 0
+ 101:             return 1
  102: 
  103: def calculateCheck(lst):
  104:     weights = [7, 3, 1]
  105:     weightIdx = 0
--------------------------------------------------------------------------------
[0.00105 s] killed by testCalculateCheck (MRTDtest.TestMRTD)

   - [#  79] CRP MRTD: 
--------------------------------------------------------------------------------
  100:         else:
  101:             return 0
  102: 
  103: def calculateCheck(lst):
- 104:     weights = [7, 3, 1]
+ 104:     weights = [8, 3, 1]
  105:     weightIdx = 0
  106:     total = 0
  107:     
  108:     for i in lst:
--------------------------------------------------------------------------------
[0.00043 s] killed by testCalculateCheck (MRTDtest.TestMRTD)

   - [#  80] CRP MRTD: 
--------------------------------------------------------------------------------
  100:         else:
  101:             return 0
  102: 
  103: def calculateCheck(lst):
- 104:     weights = [7, 3, 1]
+ 104:     weights = [7, 4, 1]
  105:     weightIdx = 0
  106:     total = 0
  107:     
  108:     for i in lst:
--------------------------------------------------------------------------------
[0.00000 s] killed by testCalculateCheck (MRTDtest.TestMRTD)

   - [#  81] CRP MRTD: 
--------------------------------------------------------------------------------
  100:         else:
  101:             return 0
  102: 
  103: def calculateCheck(lst):
- 104:     weights = [7, 3, 1]
+ 104:     weights = [7, 3, 2]
  105:     weightIdx = 0
  106:     total = 0
  107:     
  108:     for i in lst:
--------------------------------------------------------------------------------
[0.00068 s] killed by testCalculateCheck (MRTDtest.TestMRTD)

   - [#  82] CRP MRTD: 
--------------------------------------------------------------------------------
  101:             return 0
  102: 
  103: def calculateCheck(lst):
  104:     weights = [7, 3, 1]
- 105:     weightIdx = 0
+ 105:     weightIdx = 1
  106:     total = 0
  107:     
  108:     for i in lst:
  109:         numVal = getNumericalValue(i)
--------------------------------------------------------------------------------
[0.00000 s] killed by testCalculateCheck (MRTDtest.TestMRTD)

   - [#  83] CRP MRTD: 
--------------------------------------------------------------------------------
  102: 
  103: def calculateCheck(lst):
  104:     weights = [7, 3, 1]
  105:     weightIdx = 0
- 106:     total = 0
+ 106:     total = 1
  107:     
  108:     for i in lst:
  109:         numVal = getNumericalValue(i)
  110:         total += numVal * weights[weightIdx]
--------------------------------------------------------------------------------
[0.00121 s] killed by testCalculateCheck (MRTDtest.TestMRTD)

   - [#  84] CRP MRTD: 
--------------------------------------------------------------------------------
  107:     
  108:     for i in lst:
  109:         numVal = getNumericalValue(i)
  110:         total += numVal * weights[weightIdx]
- 111:         weightIdx = (weightIdx + 1) % len(weights)
+ 111:         weightIdx = (weightIdx + 2) % len(weights)
  112:     return total % 10
  113: 
  114: 
  115: 
--------------------------------------------------------------------------------
[0.00000 s] killed by testCalculateCheck (MRTDtest.TestMRTD)

   - [#  85] CRP MRTD: 
--------------------------------------------------------------------------------
  108:     for i in lst:
  109:         numVal = getNumericalValue(i)
  110:         total += numVal * weights[weightIdx]
  111:         weightIdx = (weightIdx + 1) % len(weights)
- 112:     return total % 10
+ 112:     return total % 11
  113: 
  114: 
  115: 
  116: def scanMRZ():
--------------------------------------------------------------------------------
[0.00100 s] killed by testCalculateCheck (MRTDtest.TestMRTD)

   - [#  86] CRP MRTD: 
--------------------------------------------------------------------------------
  123: def decodeMRZ():
  124:     
  125:     (line1, line2) = scanMRZ()
  126:     if (len(line1) != LINE_LENGTH or len(line2) != LINE_LENGTH):
- 127:         raise Exception(('Lines must both be ' + str(LINE_LENGTH)) + ' characters.')
+ 127:         raise Exception(('mutpy' + str(LINE_LENGTH)) + ' characters.')
  128:     travelData = TravelData()
  129:     linePos = 0
  130:     
  131:     currentString = ''
--------------------------------------------------------------------------------
[0.00120 s] survived

   - [#  87] CRP MRTD: 
--------------------------------------------------------------------------------
  123: def decodeMRZ():
  124:     
  125:     (line1, line2) = scanMRZ()
  126:     if (len(line1) != LINE_LENGTH or len(line2) != LINE_LENGTH):
- 127:         raise Exception(('Lines must both be ' + str(LINE_LENGTH)) + ' characters.')
+ 127:         raise Exception(('' + str(LINE_LENGTH)) + ' characters.')
  128:     travelData = TravelData()
  129:     linePos = 0
  130:     
  131:     currentString = ''
--------------------------------------------------------------------------------
[0.00100 s] survived

   - [#  88] CRP MRTD: 
--------------------------------------------------------------------------------
  123: def decodeMRZ():
  124:     
  125:     (line1, line2) = scanMRZ()
  126:     if (len(line1) != LINE_LENGTH or len(line2) != LINE_LENGTH):
- 127:         raise Exception(('Lines must both be ' + str(LINE_LENGTH)) + ' characters.')
+ 127:         raise Exception(('Lines must both be ' + str(LINE_LENGTH)) + 'mutpy')
  128:     travelData = TravelData()
  129:     linePos = 0
  130:     
  131:     currentString = ''
--------------------------------------------------------------------------------
[0.00101 s] survived

   - [#  89] CRP MRTD: 
--------------------------------------------------------------------------------
  123: def decodeMRZ():
  124:     
  125:     (line1, line2) = scanMRZ()
  126:     if (len(line1) != LINE_LENGTH or len(line2) != LINE_LENGTH):
- 127:         raise Exception(('Lines must both be ' + str(LINE_LENGTH)) + ' characters.')
+ 127:         raise Exception(('Lines must both be ' + str(LINE_LENGTH)) + '')
  128:     travelData = TravelData()
  129:     linePos = 0
  130:     
  131:     currentString = ''
--------------------------------------------------------------------------------
[0.00200 s] survived

   - [#  90] CRP MRTD: 
--------------------------------------------------------------------------------
  125:     (line1, line2) = scanMRZ()
  126:     if (len(line1) != LINE_LENGTH or len(line2) != LINE_LENGTH):
  127:         raise Exception(('Lines must both be ' + str(LINE_LENGTH)) + ' characters.')
  128:     travelData = TravelData()
- 129:     linePos = 0
+ 129:     linePos = 1
  130:     
  131:     currentString = ''
  132:     travelData.docType = line1[linePos:linePos + 1]
  133:     linePos += 2
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  91] CRP MRTD: 
--------------------------------------------------------------------------------
  127:         raise Exception(('Lines must both be ' + str(LINE_LENGTH)) + ' characters.')
  128:     travelData = TravelData()
  129:     linePos = 0
  130:     
- 131:     currentString = ''
+ 131:     currentString = 'mutpy'
  132:     travelData.docType = line1[linePos:linePos + 1]
  133:     linePos += 2
  134:     travelData.issuingCountry = line1[linePos:linePos + 3]
  135:     linePos += 3
--------------------------------------------------------------------------------
[0.00200 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  92] CRP MRTD: 
--------------------------------------------------------------------------------
  128:     travelData = TravelData()
  129:     linePos = 0
  130:     
  131:     currentString = ''
- 132:     travelData.docType = line1[linePos:linePos + 1]
+ 132:     travelData.docType = line1[linePos:linePos + 2]
  133:     linePos += 2
  134:     travelData.issuingCountry = line1[linePos:linePos + 3]
  135:     linePos += 3
  136:     while line1[linePos] != '<':
--------------------------------------------------------------------------------
[0.00102 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  93] CRP MRTD: 
--------------------------------------------------------------------------------
  129:     linePos = 0
  130:     
  131:     currentString = ''
  132:     travelData.docType = line1[linePos:linePos + 1]
- 133:     linePos += 2
+ 133:     linePos += 3
  134:     travelData.issuingCountry = line1[linePos:linePos + 3]
  135:     linePos += 3
  136:     while line1[linePos] != '<':
  137:         currentString += line1[linePos]
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  94] CRP MRTD: 
--------------------------------------------------------------------------------
  130:     
  131:     currentString = ''
  132:     travelData.docType = line1[linePos:linePos + 1]
  133:     linePos += 2
- 134:     travelData.issuingCountry = line1[linePos:linePos + 3]
+ 134:     travelData.issuingCountry = line1[linePos:linePos + 4]
  135:     linePos += 3
  136:     while line1[linePos] != '<':
  137:         currentString += line1[linePos]
  138:         linePos += 1
--------------------------------------------------------------------------------
[0.00101 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  95] CRP MRTD: 
--------------------------------------------------------------------------------
  131:     currentString = ''
  132:     travelData.docType = line1[linePos:linePos + 1]
  133:     linePos += 2
  134:     travelData.issuingCountry = line1[linePos:linePos + 3]
- 135:     linePos += 3
+ 135:     linePos += 4
  136:     while line1[linePos] != '<':
  137:         currentString += line1[linePos]
  138:         linePos += 1
  139:     travelData.lastName = currentString
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  96] CRP MRTD: 
--------------------------------------------------------------------------------
  132:     travelData.docType = line1[linePos:linePos + 1]
  133:     linePos += 2
  134:     travelData.issuingCountry = line1[linePos:linePos + 3]
  135:     linePos += 3
- 136:     while line1[linePos] != '<':
+ 136:     while line1[linePos] != 'mutpy':
  137:         currentString += line1[linePos]
  138:         linePos += 1
  139:     travelData.lastName = currentString
  140:     linePos += 2
--------------------------------------------------------------------------------
[0.00264 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  97] CRP MRTD: 
--------------------------------------------------------------------------------
  132:     travelData.docType = line1[linePos:linePos + 1]
  133:     linePos += 2
  134:     travelData.issuingCountry = line1[linePos:linePos + 3]
  135:     linePos += 3
- 136:     while line1[linePos] != '<':
+ 136:     while line1[linePos] != '':
  137:         currentString += line1[linePos]
  138:         linePos += 1
  139:     travelData.lastName = currentString
  140:     linePos += 2
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  98] CRP MRTD: 
--------------------------------------------------------------------------------
  134:     travelData.issuingCountry = line1[linePos:linePos + 3]
  135:     linePos += 3
  136:     while line1[linePos] != '<':
  137:         currentString += line1[linePos]
- 138:         linePos += 1
+ 138:         linePos += 2
  139:     travelData.lastName = currentString
  140:     linePos += 2
  141:     currentString = ''
  142:     while line1[linePos] != '<':
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [#  99] CRP MRTD: 
--------------------------------------------------------------------------------
  136:     while line1[linePos] != '<':
  137:         currentString += line1[linePos]
  138:         linePos += 1
  139:     travelData.lastName = currentString
- 140:     linePos += 2
+ 140:     linePos += 3
  141:     currentString = ''
  142:     while line1[linePos] != '<':
  143:         currentString += line1[linePos]
  144:         linePos += 1
--------------------------------------------------------------------------------
[0.00112 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 100] CRP MRTD: 
--------------------------------------------------------------------------------
  137:         currentString += line1[linePos]
  138:         linePos += 1
  139:     travelData.lastName = currentString
  140:     linePos += 2
- 141:     currentString = ''
+ 141:     currentString = 'mutpy'
  142:     while line1[linePos] != '<':
  143:         currentString += line1[linePos]
  144:         linePos += 1
  145:     travelData.firstName = currentString
--------------------------------------------------------------------------------
[0.00099 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 101] CRP MRTD: 
--------------------------------------------------------------------------------
  138:         linePos += 1
  139:     travelData.lastName = currentString
  140:     linePos += 2
  141:     currentString = ''
- 142:     while line1[linePos] != '<':
+ 142:     while line1[linePos] != 'mutpy':
  143:         currentString += line1[linePos]
  144:         linePos += 1
  145:     travelData.firstName = currentString
  146:     linePos += 1
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 102] CRP MRTD: 
--------------------------------------------------------------------------------
  138:         linePos += 1
  139:     travelData.lastName = currentString
  140:     linePos += 2
  141:     currentString = ''
- 142:     while line1[linePos] != '<':
+ 142:     while line1[linePos] != '':
  143:         currentString += line1[linePos]
  144:         linePos += 1
  145:     travelData.firstName = currentString
  146:     linePos += 1
--------------------------------------------------------------------------------
[0.00201 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 104] CRP MRTD: 
--------------------------------------------------------------------------------
  142:     while line1[linePos] != '<':
  143:         currentString += line1[linePos]
  144:         linePos += 1
  145:     travelData.firstName = currentString
- 146:     linePos += 1
+ 146:     linePos += 2
  147:     currentString = ''
  148:     while line1[linePos] != '<':
  149:         currentString += line1[linePos]
  150:         linePos += 1
--------------------------------------------------------------------------------
[0.00159 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 105] CRP MRTD: 
--------------------------------------------------------------------------------
  143:         currentString += line1[linePos]
  144:         linePos += 1
  145:     travelData.firstName = currentString
  146:     linePos += 1
- 147:     currentString = ''
+ 147:     currentString = 'mutpy'
  148:     while line1[linePos] != '<':
  149:         currentString += line1[linePos]
  150:         linePos += 1
  151:     travelData.middleName = currentString
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 109] CRP MRTD: 
--------------------------------------------------------------------------------
  148:     while line1[linePos] != '<':
  149:         currentString += line1[linePos]
  150:         linePos += 1
  151:     travelData.middleName = currentString
- 152:     currentString = ''
+ 152:     currentString = 'mutpy'
  153:     
  154:     
  155:     
  156:     linePos = 0
--------------------------------------------------------------------------------
[0.00099 s] survived

   - [# 110] CRP MRTD: 
--------------------------------------------------------------------------------
  152:     currentString = ''
  153:     
  154:     
  155:     
- 156:     linePos = 0
+ 156:     linePos = 1
  157:     travelData.passportNo = line2[linePos:PASSPORT_LENGTH]
  158:     linePos += PASSPORT_LENGTH
  159:     travelData.passportCheck = line2[linePos:linePos + 1]
  160:     linePos += 1
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 111] CRP MRTD: 
--------------------------------------------------------------------------------
  155:     
  156:     linePos = 0
  157:     travelData.passportNo = line2[linePos:PASSPORT_LENGTH]
  158:     linePos += PASSPORT_LENGTH
- 159:     travelData.passportCheck = line2[linePos:linePos + 1]
+ 159:     travelData.passportCheck = line2[linePos:linePos + 2]
  160:     linePos += 1
  161:     travelData.countryCode = line2[linePos:linePos + COUNTRY_CODE_LENGTH]
  162:     linePos += COUNTRY_CODE_LENGTH
  163:     travelData.birthday = line2[linePos:linePos + DATE_LENGTH]
--------------------------------------------------------------------------------
[0.00099 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 112] CRP MRTD: 
--------------------------------------------------------------------------------
  156:     linePos = 0
  157:     travelData.passportNo = line2[linePos:PASSPORT_LENGTH]
  158:     linePos += PASSPORT_LENGTH
  159:     travelData.passportCheck = line2[linePos:linePos + 1]
- 160:     linePos += 1
+ 160:     linePos += 2
  161:     travelData.countryCode = line2[linePos:linePos + COUNTRY_CODE_LENGTH]
  162:     linePos += COUNTRY_CODE_LENGTH
  163:     travelData.birthday = line2[linePos:linePos + DATE_LENGTH]
  164:     linePos += DATE_LENGTH
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 113] CRP MRTD: 
--------------------------------------------------------------------------------
  161:     travelData.countryCode = line2[linePos:linePos + COUNTRY_CODE_LENGTH]
  162:     linePos += COUNTRY_CODE_LENGTH
  163:     travelData.birthday = line2[linePos:linePos + DATE_LENGTH]
  164:     linePos += DATE_LENGTH
- 165:     travelData.birthdayCheck = line2[linePos:linePos + 1]
+ 165:     travelData.birthdayCheck = line2[linePos:linePos + 2]
  166:     linePos += 1
  167:     travelData.sex = line2[linePos:linePos + SEX_LENGTH]
  168:     linePos += 1
  169:     travelData.expirationDate = line2[linePos:linePos + DATE_LENGTH]
--------------------------------------------------------------------------------
[0.00099 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 114] CRP MRTD: 
--------------------------------------------------------------------------------
  162:     linePos += COUNTRY_CODE_LENGTH
  163:     travelData.birthday = line2[linePos:linePos + DATE_LENGTH]
  164:     linePos += DATE_LENGTH
  165:     travelData.birthdayCheck = line2[linePos:linePos + 1]
- 166:     linePos += 1
+ 166:     linePos += 2
  167:     travelData.sex = line2[linePos:linePos + SEX_LENGTH]
  168:     linePos += 1
  169:     travelData.expirationDate = line2[linePos:linePos + DATE_LENGTH]
  170:     linePos += DATE_LENGTH
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 115] CRP MRTD: 
--------------------------------------------------------------------------------
  164:     linePos += DATE_LENGTH
  165:     travelData.birthdayCheck = line2[linePos:linePos + 1]
  166:     linePos += 1
  167:     travelData.sex = line2[linePos:linePos + SEX_LENGTH]
- 168:     linePos += 1
+ 168:     linePos += 2
  169:     travelData.expirationDate = line2[linePos:linePos + DATE_LENGTH]
  170:     linePos += DATE_LENGTH
  171:     travelData.expirationCheck = line2[linePos:linePos + 1]
  172:     linePos += 1
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 116] CRP MRTD: 
--------------------------------------------------------------------------------
  167:     travelData.sex = line2[linePos:linePos + SEX_LENGTH]
  168:     linePos += 1
  169:     travelData.expirationDate = line2[linePos:linePos + DATE_LENGTH]
  170:     linePos += DATE_LENGTH
- 171:     travelData.expirationCheck = line2[linePos:linePos + 1]
+ 171:     travelData.expirationCheck = line2[linePos:linePos + 2]
  172:     linePos += 1
  173:     travelData.personalNo = line2[linePos:len(line2) - 1]
  174:     linePos = len(line2) - 1
  175:     travelData.personalNoCheck = line2[linePos]
--------------------------------------------------------------------------------
[0.00099 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 117] CRP MRTD: 
--------------------------------------------------------------------------------
  168:     linePos += 1
  169:     travelData.expirationDate = line2[linePos:linePos + DATE_LENGTH]
  170:     linePos += DATE_LENGTH
  171:     travelData.expirationCheck = line2[linePos:linePos + 1]
- 172:     linePos += 1
+ 172:     linePos += 2
  173:     travelData.personalNo = line2[linePos:len(line2) - 1]
  174:     linePos = len(line2) - 1
  175:     travelData.personalNoCheck = line2[linePos]
  176:     linePos += 1
--------------------------------------------------------------------------------
[0.00099 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 118] CRP MRTD: 
--------------------------------------------------------------------------------
  169:     travelData.expirationDate = line2[linePos:linePos + DATE_LENGTH]
  170:     linePos += DATE_LENGTH
  171:     travelData.expirationCheck = line2[linePos:linePos + 1]
  172:     linePos += 1
- 173:     travelData.personalNo = line2[linePos:len(line2) - 1]
+ 173:     travelData.personalNo = line2[linePos:len(line2) - 2]
  174:     linePos = len(line2) - 1
  175:     travelData.personalNoCheck = line2[linePos]
  176:     linePos += 1
  177:     return travelData
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 119] CRP MRTD: 
--------------------------------------------------------------------------------
  170:     linePos += DATE_LENGTH
  171:     travelData.expirationCheck = line2[linePos:linePos + 1]
  172:     linePos += 1
  173:     travelData.personalNo = line2[linePos:len(line2) - 1]
- 174:     linePos = len(line2) - 1
+ 174:     linePos = len(line2) - 2
  175:     travelData.personalNoCheck = line2[linePos]
  176:     linePos += 1
  177:     return travelData
  178: 
--------------------------------------------------------------------------------
[0.00099 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 120] CRP MRTD: 
--------------------------------------------------------------------------------
  172:     linePos += 1
  173:     travelData.personalNo = line2[linePos:len(line2) - 1]
  174:     linePos = len(line2) - 1
  175:     travelData.personalNoCheck = line2[linePos]
- 176:     linePos += 1
+ 176:     linePos += 2
  177:     return travelData
  178: 
  179: 
  180: 
--------------------------------------------------------------------------------
[0.00101 s] survived

   - [# 121] CRP MRTD: 
--------------------------------------------------------------------------------
  185: 
  186: def encodeMRZ(personalNo):
  187:     data = getTravelDataFromDB(personalNo)
  188:     
- 189:     line1 = ((((((data.docType + '<') + data.issuingCountry) + data.lastName) + '<<') + data.firstName) + '<') + data.middleName
+ 189:     line1 = ((((((data.docType + 'mutpy') + data.issuingCountry) + data.lastName) + '<<') + data.firstName) + '<') + data.middleName
  190:     while len(line1) < LINE_LENGTH:
  191:         line1 += '<'
  192:     
  193:     
--------------------------------------------------------------------------------
[0.00199 s] killed by testEncodeMRZ (MRTDtest.TestMRTD)

   - [# 122] CRP MRTD: 
--------------------------------------------------------------------------------
  185: 
  186: def encodeMRZ(personalNo):
  187:     data = getTravelDataFromDB(personalNo)
  188:     
- 189:     line1 = ((((((data.docType + '<') + data.issuingCountry) + data.lastName) + '<<') + data.firstName) + '<') + data.middleName
+ 189:     line1 = ((((((data.docType + '') + data.issuingCountry) + data.lastName) + '<<') + data.firstName) + '<') + data.middleName
  190:     while len(line1) < LINE_LENGTH:
  191:         line1 += '<'
  192:     
  193:     
--------------------------------------------------------------------------------
[0.00251 s] killed by testEncodeMRZ (MRTDtest.TestMRTD)

   - [# 123] CRP MRTD: 
--------------------------------------------------------------------------------
  185: 
  186: def encodeMRZ(personalNo):
  187:     data = getTravelDataFromDB(personalNo)
  188:     
- 189:     line1 = ((((((data.docType + '<') + data.issuingCountry) + data.lastName) + '<<') + data.firstName) + '<') + data.middleName
+ 189:     line1 = ((((((data.docType + '<') + data.issuingCountry) + data.lastName) + 'mutpy') + data.firstName) + '<') + data.middleName
  190:     while len(line1) < LINE_LENGTH:
  191:         line1 += '<'
  192:     
  193:     
--------------------------------------------------------------------------------
[0.02135 s] killed by testEncodeMRZ (MRTDtest.TestMRTD)
