   - [# 124] CRP MRTD: 
--------------------------------------------------------------------------------
  185: 
  186: def encodeMRZ(personalNo):
  187:     data = getTravelDataFromDB(personalNo)
  188:     
- 189:     line1 = ((((((data.docType + '<') + data.issuingCountry) + data.lastName) + '<<') + data.firstName) + '<') + data.middleName
+ 189:     line1 = ((((((data.docType + '<') + data.issuingCountry) + data.lastName) + '') + data.firstName) + '<') + data.middleName
  190:     while len(line1) < LINE_LENGTH:
  191:         line1 += '<'
  192:     
  193:     
--------------------------------------------------------------------------------
[0.00235 s] killed by testEncodeMRZ (MRTDtest.TestMRTD)

   - [# 125] CRP MRTD: 
--------------------------------------------------------------------------------
  185: 
  186: def encodeMRZ(personalNo):
  187:     data = getTravelDataFromDB(personalNo)
  188:     
- 189:     line1 = ((((((data.docType + '<') + data.issuingCountry) + data.lastName) + '<<') + data.firstName) + '<') + data.middleName
+ 189:     line1 = ((((((data.docType + '<') + data.issuingCountry) + data.lastName) + '<<') + data.firstName) + 'mutpy') + data.middleName
  190:     while len(line1) < LINE_LENGTH:
  191:         line1 += '<'
  192:     
  193:     
--------------------------------------------------------------------------------
[0.00200 s] killed by testEncodeMRZ (MRTDtest.TestMRTD)

   - [# 126] CRP MRTD: 
--------------------------------------------------------------------------------
  185: 
  186: def encodeMRZ(personalNo):
  187:     data = getTravelDataFromDB(personalNo)
  188:     
- 189:     line1 = ((((((data.docType + '<') + data.issuingCountry) + data.lastName) + '<<') + data.firstName) + '<') + data.middleName
+ 189:     line1 = ((((((data.docType + '<') + data.issuingCountry) + data.lastName) + '<<') + data.firstName) + '') + data.middleName
  190:     while len(line1) < LINE_LENGTH:
  191:         line1 += '<'
  192:     
  193:     
--------------------------------------------------------------------------------
[0.00203 s] killed by testEncodeMRZ (MRTDtest.TestMRTD)

   - [# 127] CRP MRTD: 
--------------------------------------------------------------------------------
  187:     data = getTravelDataFromDB(personalNo)
  188:     
  189:     line1 = ((((((data.docType + '<') + data.issuingCountry) + data.lastName) + '<<') + data.firstName) + '<') + data.middleName
  190:     while len(line1) < LINE_LENGTH:
- 191:         line1 += '<'
+ 191:         line1 += 'mutpy'
  192:     
  193:     
  194:     line2 = ((((((((data.passportNo + data.passportCheck) + data.countryCode) + data.birthday) + data.birthdayCheck) + data.sex) + data.expirationDate) + data.expirationCheck) + data.personalNo) + data.personalNoCheck
  195:     
--------------------------------------------------------------------------------
[0.00200 s] killed by testEncodeMRZ (MRTDtest.TestMRTD)

   - [# 128] CRP MRTD: 
--------------------------------------------------------------------------------
  187:     data = getTravelDataFromDB(personalNo)
  188:     
  189:     line1 = ((((((data.docType + '<') + data.issuingCountry) + data.lastName) + '<<') + data.firstName) + '<') + data.middleName
  190:     while len(line1) < LINE_LENGTH:
- 191:         line1 += '<'
+ 191:         line1 += ''
  192:     
  193:     
  194:     line2 = ((((((((data.passportNo + data.passportCheck) + data.countryCode) + data.birthday) + data.birthdayCheck) + data.sex) + data.expirationDate) + data.expirationCheck) + data.personalNo) + data.personalNoCheck
  195:     
--------------------------------------------------------------------------------
[5.04219 s] timeout

   - [# 129] EHD MRTD: 
--------------------------------------------------------------------------------
   94:     try:
   95:         int(i)
   96:         return int(i)
   97:     except ValueError:
-  98:         if (str(i) >= 'A' and str(i) <= 'Z'):
-  99:             return int(ord(str(i)) - 55)
- 100:         else:
- 101:             return 0
+  98:         raise
+  99: 
+ 100: 
+ 101: 
  102: 
  103: def calculateCheck(lst):
  104:     weights = [7, 3, 1]
  105:     weightIdx = 0
--------------------------------------------------------------------------------
[0.00100 s] killed by testCalculateCheck (MRTDtest.TestMRTD)

   - [# 131] LCR MRTD: 
--------------------------------------------------------------------------------
   94:     try:
   95:         int(i)
   96:         return int(i)
   97:     except ValueError:
-  98:         if (str(i) >= 'A' and str(i) <= 'Z'):
+  98:         if (str(i) >= 'A' or str(i) <= 'Z'):
   99:             return int(ord(str(i)) - 55)
  100:         else:
  101:             return 0
  102: 
--------------------------------------------------------------------------------
[0.00000 s] killed by testCalculateCheck (MRTDtest.TestMRTD)

   - [# 132] LCR MRTD: 
--------------------------------------------------------------------------------
  122: 
  123: def decodeMRZ():
  124:     
  125:     (line1, line2) = scanMRZ()
- 126:     if (len(line1) != LINE_LENGTH or len(line2) != LINE_LENGTH):
+ 126:     if (len(line1) != LINE_LENGTH and len(line2) != LINE_LENGTH):
  127:         raise Exception(('Lines must both be ' + str(LINE_LENGTH)) + ' characters.')
  128:     travelData = TravelData()
  129:     linePos = 0
  130:     
--------------------------------------------------------------------------------
[0.00101 s] killed by testDecodeMRZ4 (MRTDtest.TestMRTD)

   - [# 133] ROR MRTD: 
--------------------------------------------------------------------------------
   94:     try:
   95:         int(i)
   96:         return int(i)
   97:     except ValueError:
-  98:         if (str(i) >= 'A' and str(i) <= 'Z'):
+  98:         if (str(i) <= 'A' and str(i) <= 'Z'):
   99:             return int(ord(str(i)) - 55)
  100:         else:
  101:             return 0
  102: 
--------------------------------------------------------------------------------
[0.00000 s] killed by testCalculateCheck (MRTDtest.TestMRTD)

   - [# 134] ROR MRTD: 
--------------------------------------------------------------------------------
   94:     try:
   95:         int(i)
   96:         return int(i)
   97:     except ValueError:
-  98:         if (str(i) >= 'A' and str(i) <= 'Z'):
+  98:         if (str(i) > 'A' and str(i) <= 'Z'):
   99:             return int(ord(str(i)) - 55)
  100:         else:
  101:             return 0
  102: 
--------------------------------------------------------------------------------
[0.00212 s] killed by testGetNumericalValue (MRTDtest.TestMRTD)

   - [# 135] ROR MRTD: 
--------------------------------------------------------------------------------
   94:     try:
   95:         int(i)
   96:         return int(i)
   97:     except ValueError:
-  98:         if (str(i) >= 'A' and str(i) <= 'Z'):
+  98:         if (str(i) >= 'A' and str(i) >= 'Z'):
   99:             return int(ord(str(i)) - 55)
  100:         else:
  101:             return 0
  102: 
--------------------------------------------------------------------------------
[0.00100 s] killed by testCalculateCheck (MRTDtest.TestMRTD)

   - [# 136] ROR MRTD: 
--------------------------------------------------------------------------------
   94:     try:
   95:         int(i)
   96:         return int(i)
   97:     except ValueError:
-  98:         if (str(i) >= 'A' and str(i) <= 'Z'):
+  98:         if (str(i) >= 'A' and str(i) < 'Z'):
   99:             return int(ord(str(i)) - 55)
  100:         else:
  101:             return 0
  102: 
--------------------------------------------------------------------------------
[0.00100 s] killed by testCalculateCheck (MRTDtest.TestMRTD)

   - [# 137] ROR MRTD: 
--------------------------------------------------------------------------------
  122: 
  123: def decodeMRZ():
  124:     
  125:     (line1, line2) = scanMRZ()
- 126:     if (len(line1) != LINE_LENGTH or len(line2) != LINE_LENGTH):
+ 126:     if (len(line1) == LINE_LENGTH or len(line2) != LINE_LENGTH):
  127:         raise Exception(('Lines must both be ' + str(LINE_LENGTH)) + ' characters.')
  128:     travelData = TravelData()
  129:     linePos = 0
  130:     
--------------------------------------------------------------------------------
[0.00199 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 138] ROR MRTD: 
--------------------------------------------------------------------------------
  122: 
  123: def decodeMRZ():
  124:     
  125:     (line1, line2) = scanMRZ()
- 126:     if (len(line1) != LINE_LENGTH or len(line2) != LINE_LENGTH):
+ 126:     if (len(line1) != LINE_LENGTH or len(line2) == LINE_LENGTH):
  127:         raise Exception(('Lines must both be ' + str(LINE_LENGTH)) + ' characters.')
  128:     travelData = TravelData()
  129:     linePos = 0
  130:     
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 139] ROR MRTD: 
--------------------------------------------------------------------------------
  132:     travelData.docType = line1[linePos:linePos + 1]
  133:     linePos += 2
  134:     travelData.issuingCountry = line1[linePos:linePos + 3]
  135:     linePos += 3
- 136:     while line1[linePos] != '<':
+ 136:     while line1[linePos] == '<':
  137:         currentString += line1[linePos]
  138:         linePos += 1
  139:     travelData.lastName = currentString
  140:     linePos += 2
--------------------------------------------------------------------------------
[0.00099 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 140] ROR MRTD: 
--------------------------------------------------------------------------------
  138:         linePos += 1
  139:     travelData.lastName = currentString
  140:     linePos += 2
  141:     currentString = ''
- 142:     while line1[linePos] != '<':
+ 142:     while line1[linePos] == '<':
  143:         currentString += line1[linePos]
  144:         linePos += 1
  145:     travelData.firstName = currentString
  146:     linePos += 1
--------------------------------------------------------------------------------
[0.00099 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 142] ROR MRTD: 
--------------------------------------------------------------------------------
  186: def encodeMRZ(personalNo):
  187:     data = getTravelDataFromDB(personalNo)
  188:     
  189:     line1 = ((((((data.docType + '<') + data.issuingCountry) + data.lastName) + '<<') + data.firstName) + '<') + data.middleName
- 190:     while len(line1) < LINE_LENGTH:
+ 190:     while len(line1) > LINE_LENGTH:
  191:         line1 += '<'
  192:     
  193:     
  194:     line2 = ((((((((data.passportNo + data.passportCheck) + data.countryCode) + data.birthday) + data.birthdayCheck) + data.sex) + data.expirationDate) + data.expirationCheck) + data.personalNo) + data.personalNoCheck
--------------------------------------------------------------------------------
[0.00341 s] killed by testEncodeMRZ (MRTDtest.TestMRTD)

   - [# 143] ROR MRTD: 
--------------------------------------------------------------------------------
  186: def encodeMRZ(personalNo):
  187:     data = getTravelDataFromDB(personalNo)
  188:     
  189:     line1 = ((((((data.docType + '<') + data.issuingCountry) + data.lastName) + '<<') + data.firstName) + '<') + data.middleName
- 190:     while len(line1) < LINE_LENGTH:
+ 190:     while len(line1) <= LINE_LENGTH:
  191:         line1 += '<'
  192:     
  193:     
  194:     line2 = ((((((((data.passportNo + data.passportCheck) + data.countryCode) + data.birthday) + data.birthdayCheck) + data.sex) + data.expirationDate) + data.expirationCheck) + data.personalNo) + data.personalNoCheck
--------------------------------------------------------------------------------
[0.00200 s] killed by testEncodeMRZ (MRTDtest.TestMRTD)

   - [# 144] ROR MRTD: 
--------------------------------------------------------------------------------
  199: 
  200: def checkMismatches(travelData):
  201:     
  202:     errors = TravelDataError()
- 203:     if int(travelData.passportCheck) != calculateCheck(travelData.passportNo):
+ 203:     if int(travelData.passportCheck) == calculateCheck(travelData.passportNo):
  204:         errors.passportError = True
  205:     else:
  206:         errors.passportError = False
  207:     
--------------------------------------------------------------------------------
[0.00100 s] killed by testCheckMismatches (MRTDtest.TestMRTD)

   - [# 145] ROR MRTD: 
--------------------------------------------------------------------------------
  204:         errors.passportError = True
  205:     else:
  206:         errors.passportError = False
  207:     
- 208:     if int(travelData.birthdayCheck) != calculateCheck(travelData.birthday):
+ 208:     if int(travelData.birthdayCheck) == calculateCheck(travelData.birthday):
  209:         errors.birthdayError = True
  210:     else:
  211:         errors.birthdayError = False
  212:     
--------------------------------------------------------------------------------
[0.00101 s] killed by testCheckMismatches (MRTDtest.TestMRTD)

   - [# 146] ROR MRTD: 
--------------------------------------------------------------------------------
  209:         errors.birthdayError = True
  210:     else:
  211:         errors.birthdayError = False
  212:     
- 213:     if int(travelData.expirationCheck) != calculateCheck(travelData.expirationDate):
+ 213:     if int(travelData.expirationCheck) == calculateCheck(travelData.expirationDate):
  214:         errors.expirationError = True
  215:     else:
  216:         errors.expirationError = False
  217:     
--------------------------------------------------------------------------------
[0.00111 s] killed by testCheckMismatches (MRTDtest.TestMRTD)

   - [# 147] ROR MRTD: 
--------------------------------------------------------------------------------
  214:         errors.expirationError = True
  215:     else:
  216:         errors.expirationError = False
  217:     
- 218:     if int(travelData.personalNoCheck) != calculateCheck(travelData.personalNo):
+ 218:     if int(travelData.personalNoCheck) == calculateCheck(travelData.personalNo):
  219:         errors.personalError = True
  220:     else:
  221:         errors.personalError = False
  222:     return errors
--------------------------------------------------------------------------------
[0.00099 s] killed by testCheckMismatches (MRTDtest.TestMRTD)

   - [# 148] SIR MRTD: 
--------------------------------------------------------------------------------
  128:     travelData = TravelData()
  129:     linePos = 0
  130:     
  131:     currentString = ''
- 132:     travelData.docType = line1[linePos:linePos + 1]
+ 132:     travelData.docType = line1[:linePos + 1]
  133:     linePos += 2
  134:     travelData.issuingCountry = line1[linePos:linePos + 3]
  135:     linePos += 3
  136:     while line1[linePos] != '<':
--------------------------------------------------------------------------------
[0.00201 s] survived

   - [# 149] SIR MRTD: 
--------------------------------------------------------------------------------
  128:     travelData = TravelData()
  129:     linePos = 0
  130:     
  131:     currentString = ''
- 132:     travelData.docType = line1[linePos:linePos + 1]
+ 132:     travelData.docType = line1[linePos:]
  133:     linePos += 2
  134:     travelData.issuingCountry = line1[linePos:linePos + 3]
  135:     linePos += 3
  136:     while line1[linePos] != '<':
--------------------------------------------------------------------------------
[0.00101 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 150] SIR MRTD: 
--------------------------------------------------------------------------------
  130:     
  131:     currentString = ''
  132:     travelData.docType = line1[linePos:linePos + 1]
  133:     linePos += 2
- 134:     travelData.issuingCountry = line1[linePos:linePos + 3]
+ 134:     travelData.issuingCountry = line1[:linePos + 3]
  135:     linePos += 3
  136:     while line1[linePos] != '<':
  137:         currentString += line1[linePos]
  138:         linePos += 1
--------------------------------------------------------------------------------
[0.00101 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 151] SIR MRTD: 
--------------------------------------------------------------------------------
  130:     
  131:     currentString = ''
  132:     travelData.docType = line1[linePos:linePos + 1]
  133:     linePos += 2
- 134:     travelData.issuingCountry = line1[linePos:linePos + 3]
+ 134:     travelData.issuingCountry = line1[linePos:]
  135:     linePos += 3
  136:     while line1[linePos] != '<':
  137:         currentString += line1[linePos]
  138:         linePos += 1
--------------------------------------------------------------------------------
[0.00201 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 152] SIR MRTD: 
--------------------------------------------------------------------------------
  153:     
  154:     
  155:     
  156:     linePos = 0
- 157:     travelData.passportNo = line2[linePos:PASSPORT_LENGTH]
+ 157:     travelData.passportNo = line2[:PASSPORT_LENGTH]
  158:     linePos += PASSPORT_LENGTH
  159:     travelData.passportCheck = line2[linePos:linePos + 1]
  160:     linePos += 1
  161:     travelData.countryCode = line2[linePos:linePos + COUNTRY_CODE_LENGTH]
--------------------------------------------------------------------------------
[0.00200 s] survived

   - [# 153] SIR MRTD: 
--------------------------------------------------------------------------------
  153:     
  154:     
  155:     
  156:     linePos = 0
- 157:     travelData.passportNo = line2[linePos:PASSPORT_LENGTH]
+ 157:     travelData.passportNo = line2[linePos:]
  158:     linePos += PASSPORT_LENGTH
  159:     travelData.passportCheck = line2[linePos:linePos + 1]
  160:     linePos += 1
  161:     travelData.countryCode = line2[linePos:linePos + COUNTRY_CODE_LENGTH]
--------------------------------------------------------------------------------
[0.00112 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 154] SIR MRTD: 
--------------------------------------------------------------------------------
  155:     
  156:     linePos = 0
  157:     travelData.passportNo = line2[linePos:PASSPORT_LENGTH]
  158:     linePos += PASSPORT_LENGTH
- 159:     travelData.passportCheck = line2[linePos:linePos + 1]
+ 159:     travelData.passportCheck = line2[:linePos + 1]
  160:     linePos += 1
  161:     travelData.countryCode = line2[linePos:linePos + COUNTRY_CODE_LENGTH]
  162:     linePos += COUNTRY_CODE_LENGTH
  163:     travelData.birthday = line2[linePos:linePos + DATE_LENGTH]
--------------------------------------------------------------------------------
[0.00099 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 155] SIR MRTD: 
--------------------------------------------------------------------------------
  155:     
  156:     linePos = 0
  157:     travelData.passportNo = line2[linePos:PASSPORT_LENGTH]
  158:     linePos += PASSPORT_LENGTH
- 159:     travelData.passportCheck = line2[linePos:linePos + 1]
+ 159:     travelData.passportCheck = line2[linePos:]
  160:     linePos += 1
  161:     travelData.countryCode = line2[linePos:linePos + COUNTRY_CODE_LENGTH]
  162:     linePos += COUNTRY_CODE_LENGTH
  163:     travelData.birthday = line2[linePos:linePos + DATE_LENGTH]
--------------------------------------------------------------------------------
[0.00199 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 156] SIR MRTD: 
--------------------------------------------------------------------------------
  157:     travelData.passportNo = line2[linePos:PASSPORT_LENGTH]
  158:     linePos += PASSPORT_LENGTH
  159:     travelData.passportCheck = line2[linePos:linePos + 1]
  160:     linePos += 1
- 161:     travelData.countryCode = line2[linePos:linePos + COUNTRY_CODE_LENGTH]
+ 161:     travelData.countryCode = line2[:linePos + COUNTRY_CODE_LENGTH]
  162:     linePos += COUNTRY_CODE_LENGTH
  163:     travelData.birthday = line2[linePos:linePos + DATE_LENGTH]
  164:     linePos += DATE_LENGTH
  165:     travelData.birthdayCheck = line2[linePos:linePos + 1]
--------------------------------------------------------------------------------
[0.00101 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 157] SIR MRTD: 
--------------------------------------------------------------------------------
  157:     travelData.passportNo = line2[linePos:PASSPORT_LENGTH]
  158:     linePos += PASSPORT_LENGTH
  159:     travelData.passportCheck = line2[linePos:linePos + 1]
  160:     linePos += 1
- 161:     travelData.countryCode = line2[linePos:linePos + COUNTRY_CODE_LENGTH]
+ 161:     travelData.countryCode = line2[linePos:]
  162:     linePos += COUNTRY_CODE_LENGTH
  163:     travelData.birthday = line2[linePos:linePos + DATE_LENGTH]
  164:     linePos += DATE_LENGTH
  165:     travelData.birthdayCheck = line2[linePos:linePos + 1]
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 158] SIR MRTD: 
--------------------------------------------------------------------------------
  159:     travelData.passportCheck = line2[linePos:linePos + 1]
  160:     linePos += 1
  161:     travelData.countryCode = line2[linePos:linePos + COUNTRY_CODE_LENGTH]
  162:     linePos += COUNTRY_CODE_LENGTH
- 163:     travelData.birthday = line2[linePos:linePos + DATE_LENGTH]
+ 163:     travelData.birthday = line2[:linePos + DATE_LENGTH]
  164:     linePos += DATE_LENGTH
  165:     travelData.birthdayCheck = line2[linePos:linePos + 1]
  166:     linePos += 1
  167:     travelData.sex = line2[linePos:linePos + SEX_LENGTH]
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 159] SIR MRTD: 
--------------------------------------------------------------------------------
  159:     travelData.passportCheck = line2[linePos:linePos + 1]
  160:     linePos += 1
  161:     travelData.countryCode = line2[linePos:linePos + COUNTRY_CODE_LENGTH]
  162:     linePos += COUNTRY_CODE_LENGTH
- 163:     travelData.birthday = line2[linePos:linePos + DATE_LENGTH]
+ 163:     travelData.birthday = line2[linePos:]
  164:     linePos += DATE_LENGTH
  165:     travelData.birthdayCheck = line2[linePos:linePos + 1]
  166:     linePos += 1
  167:     travelData.sex = line2[linePos:linePos + SEX_LENGTH]
--------------------------------------------------------------------------------
[0.00099 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 160] SIR MRTD: 
--------------------------------------------------------------------------------
  161:     travelData.countryCode = line2[linePos:linePos + COUNTRY_CODE_LENGTH]
  162:     linePos += COUNTRY_CODE_LENGTH
  163:     travelData.birthday = line2[linePos:linePos + DATE_LENGTH]
  164:     linePos += DATE_LENGTH
- 165:     travelData.birthdayCheck = line2[linePos:linePos + 1]
+ 165:     travelData.birthdayCheck = line2[:linePos + 1]
  166:     linePos += 1
  167:     travelData.sex = line2[linePos:linePos + SEX_LENGTH]
  168:     linePos += 1
  169:     travelData.expirationDate = line2[linePos:linePos + DATE_LENGTH]
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 161] SIR MRTD: 
--------------------------------------------------------------------------------
  161:     travelData.countryCode = line2[linePos:linePos + COUNTRY_CODE_LENGTH]
  162:     linePos += COUNTRY_CODE_LENGTH
  163:     travelData.birthday = line2[linePos:linePos + DATE_LENGTH]
  164:     linePos += DATE_LENGTH
- 165:     travelData.birthdayCheck = line2[linePos:linePos + 1]
+ 165:     travelData.birthdayCheck = line2[linePos:]
  166:     linePos += 1
  167:     travelData.sex = line2[linePos:linePos + SEX_LENGTH]
  168:     linePos += 1
  169:     travelData.expirationDate = line2[linePos:linePos + DATE_LENGTH]
--------------------------------------------------------------------------------
[0.00099 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 162] SIR MRTD: 
--------------------------------------------------------------------------------
  163:     travelData.birthday = line2[linePos:linePos + DATE_LENGTH]
  164:     linePos += DATE_LENGTH
  165:     travelData.birthdayCheck = line2[linePos:linePos + 1]
  166:     linePos += 1
- 167:     travelData.sex = line2[linePos:linePos + SEX_LENGTH]
+ 167:     travelData.sex = line2[:linePos + SEX_LENGTH]
  168:     linePos += 1
  169:     travelData.expirationDate = line2[linePos:linePos + DATE_LENGTH]
  170:     linePos += DATE_LENGTH
  171:     travelData.expirationCheck = line2[linePos:linePos + 1]
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 163] SIR MRTD: 
--------------------------------------------------------------------------------
  163:     travelData.birthday = line2[linePos:linePos + DATE_LENGTH]
  164:     linePos += DATE_LENGTH
  165:     travelData.birthdayCheck = line2[linePos:linePos + 1]
  166:     linePos += 1
- 167:     travelData.sex = line2[linePos:linePos + SEX_LENGTH]
+ 167:     travelData.sex = line2[linePos:]
  168:     linePos += 1
  169:     travelData.expirationDate = line2[linePos:linePos + DATE_LENGTH]
  170:     linePos += DATE_LENGTH
  171:     travelData.expirationCheck = line2[linePos:linePos + 1]
--------------------------------------------------------------------------------
[0.00099 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 164] SIR MRTD: 
--------------------------------------------------------------------------------
  165:     travelData.birthdayCheck = line2[linePos:linePos + 1]
  166:     linePos += 1
  167:     travelData.sex = line2[linePos:linePos + SEX_LENGTH]
  168:     linePos += 1
- 169:     travelData.expirationDate = line2[linePos:linePos + DATE_LENGTH]
+ 169:     travelData.expirationDate = line2[:linePos + DATE_LENGTH]
  170:     linePos += DATE_LENGTH
  171:     travelData.expirationCheck = line2[linePos:linePos + 1]
  172:     linePos += 1
  173:     travelData.personalNo = line2[linePos:len(line2) - 1]
--------------------------------------------------------------------------------
[0.00175 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 165] SIR MRTD: 
--------------------------------------------------------------------------------
  165:     travelData.birthdayCheck = line2[linePos:linePos + 1]
  166:     linePos += 1
  167:     travelData.sex = line2[linePos:linePos + SEX_LENGTH]
  168:     linePos += 1
- 169:     travelData.expirationDate = line2[linePos:linePos + DATE_LENGTH]
+ 169:     travelData.expirationDate = line2[linePos:]
  170:     linePos += DATE_LENGTH
  171:     travelData.expirationCheck = line2[linePos:linePos + 1]
  172:     linePos += 1
  173:     travelData.personalNo = line2[linePos:len(line2) - 1]
--------------------------------------------------------------------------------
[0.00099 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 166] SIR MRTD: 
--------------------------------------------------------------------------------
  167:     travelData.sex = line2[linePos:linePos + SEX_LENGTH]
  168:     linePos += 1
  169:     travelData.expirationDate = line2[linePos:linePos + DATE_LENGTH]
  170:     linePos += DATE_LENGTH
- 171:     travelData.expirationCheck = line2[linePos:linePos + 1]
+ 171:     travelData.expirationCheck = line2[:linePos + 1]
  172:     linePos += 1
  173:     travelData.personalNo = line2[linePos:len(line2) - 1]
  174:     linePos = len(line2) - 1
  175:     travelData.personalNoCheck = line2[linePos]
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 167] SIR MRTD: 
--------------------------------------------------------------------------------
  167:     travelData.sex = line2[linePos:linePos + SEX_LENGTH]
  168:     linePos += 1
  169:     travelData.expirationDate = line2[linePos:linePos + DATE_LENGTH]
  170:     linePos += DATE_LENGTH
- 171:     travelData.expirationCheck = line2[linePos:linePos + 1]
+ 171:     travelData.expirationCheck = line2[linePos:]
  172:     linePos += 1
  173:     travelData.personalNo = line2[linePos:len(line2) - 1]
  174:     linePos = len(line2) - 1
  175:     travelData.personalNoCheck = line2[linePos]
--------------------------------------------------------------------------------
[0.00099 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)

   - [# 168] SIR MRTD: 
--------------------------------------------------------------------------------
  169:     travelData.expirationDate = line2[linePos:linePos + DATE_LENGTH]
  170:     linePos += DATE_LENGTH
  171:     travelData.expirationCheck = line2[linePos:linePos + 1]
  172:     linePos += 1
- 173:     travelData.personalNo = line2[linePos:len(line2) - 1]
+ 173:     travelData.personalNo = line2[:len(line2) - 1]
  174:     linePos = len(line2) - 1
  175:     travelData.personalNoCheck = line2[linePos]
  176:     linePos += 1
  177:     return travelData
--------------------------------------------------------------------------------
[0.00099 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)
