   - [# 169] SIR MRTD: 
--------------------------------------------------------------------------------
  169:     travelData.expirationDate = line2[linePos:linePos + DATE_LENGTH]
  170:     linePos += DATE_LENGTH
  171:     travelData.expirationCheck = line2[linePos:linePos + 1]
  172:     linePos += 1
- 173:     travelData.personalNo = line2[linePos:len(line2) - 1]
+ 173:     travelData.personalNo = line2[linePos:]
  174:     linePos = len(line2) - 1
  175:     travelData.personalNoCheck = line2[linePos]
  176:     linePos += 1
  177:     return travelData
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest.TestMRTD)
