   - [#   2] AOR MRTD: 
--------------------------------------------------------------------------------
   65:     except ValueError:
   66:         if (str(i) >= 'A' and str(i) <= 'Z'):
   67:             return int(ord(str(i)) - 55)
   68:         elif (str(i) >= 'a' and str(i) <= 'z'):
-  69:             return int(ord(str(i)) - 87)
+  69:             return int(ord(str(i)) + 87)
   70:         else:
   71:             return 0
   72: 
   73: def calculateCheck(lst):
--------------------------------------------------------------------------------
[0.00300 s] killed by testGetNumericalValue (MRTDtest_v2.TestMRTD)

   - [#  15] AOR MRTD: 
--------------------------------------------------------------------------------
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
  110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
  111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
- 112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
+ 112:             raise Exception(('Invalid character ' - line1[linePos]) + ' in last name')
  113:         currentString += line1[linePos]
  114:         linePos += 1
  115:     travelData.lastName = currentString
  116:     linePos += 2
--------------------------------------------------------------------------------
[0.01823 s] survived

   - [#  16] AOR MRTD: 
--------------------------------------------------------------------------------
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
  110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
  111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
- 112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
+ 112:             raise Exception(('Invalid character ' + line1[linePos]) - ' in last name')
  113:         currentString += line1[linePos]
  114:         linePos += 1
  115:     travelData.lastName = currentString
  116:     linePos += 2
--------------------------------------------------------------------------------
[0.00302 s] survived

   - [#  17] AOR MRTD: 
--------------------------------------------------------------------------------
  116:     linePos += 2
  117:     currentString = ''
  118:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
  119:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
- 120:             raise Exception(('Invalid character ' + line1[linePos]) + ' in first name')
+ 120:             raise Exception(('Invalid character ' - line1[linePos]) + ' in first name')
  121:         currentString += line1[linePos]
  122:         linePos += 1
  123:     travelData.firstName = currentString
  124:     linePos += 1
--------------------------------------------------------------------------------
[0.00303 s] survived

   - [#  18] AOR MRTD: 
--------------------------------------------------------------------------------
  116:     linePos += 2
  117:     currentString = ''
  118:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
  119:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
- 120:             raise Exception(('Invalid character ' + line1[linePos]) + ' in first name')
+ 120:             raise Exception(('Invalid character ' + line1[linePos]) - ' in first name')
  121:         currentString += line1[linePos]
  122:         linePos += 1
  123:     travelData.firstName = currentString
  124:     linePos += 1
--------------------------------------------------------------------------------
[0.00301 s] survived

   - [#  19] AOR MRTD: 
--------------------------------------------------------------------------------
  124:     linePos += 1
  125:     currentString = ''
  126:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
  127:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
- 128:             raise Exception(('Invalid character ' + line1[linePos]) + ' in middle name')
+ 128:             raise Exception(('Invalid character ' - line1[linePos]) + ' in middle name')
  129:         currentString += line1[linePos]
  130:         linePos += 1
  131:     travelData.middleName = currentString
  132:     currentString = ''
--------------------------------------------------------------------------------
[0.00300 s] survived

   - [#  20] AOR MRTD: 
--------------------------------------------------------------------------------
  124:     linePos += 1
  125:     currentString = ''
  126:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
  127:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
- 128:             raise Exception(('Invalid character ' + line1[linePos]) + ' in middle name')
+ 128:             raise Exception(('Invalid character ' + line1[linePos]) - ' in middle name')
  129:         currentString += line1[linePos]
  130:         linePos += 1
  131:     travelData.middleName = currentString
  132:     currentString = ''
--------------------------------------------------------------------------------
[0.00300 s] survived

   - [#  71] COD MRTD: 
--------------------------------------------------------------------------------
  107:     linePos += 2
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
  110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
- 111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
+ 111:         if ((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z')):
  112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  113:         currentString += line1[linePos]
  114:         linePos += 1
  115:     travelData.lastName = currentString
--------------------------------------------------------------------------------
[0.00101 s] killed by testDecodeMRZ (MRTDtest_v2.TestMRTD)

   - [#  75] COI MRTD: 
--------------------------------------------------------------------------------
   64:         return int(i)
   65:     except ValueError:
   66:         if (str(i) >= 'A' and str(i) <= 'Z'):
   67:             return int(ord(str(i)) - 55)
-  68:         elif (str(i) >= 'a' and str(i) <= 'z'):
+  68:         elif not ((str(i) >= 'a' and str(i) <= 'z')):
   69:             return int(ord(str(i)) - 87)
   70:         else:
   71:             return 0
   72: 
--------------------------------------------------------------------------------
[0.00000 s] killed by testCalculateCheck (MRTDtest_v2.TestMRTD)

   - [#  78] COI MRTD: 
--------------------------------------------------------------------------------
  106:     travelData.docType = line1[linePos:linePos + 1]
  107:     linePos += 2
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
- 110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
+ 110:     while not ((linePos < LINE_LENGTH and line1[linePos] != '<')):
  111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
  112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  113:         currentString += line1[linePos]
  114:         linePos += 1
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest_v2.TestMRTD)

   - [#  79] COI MRTD: 
--------------------------------------------------------------------------------
  107:     linePos += 2
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
  110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
- 111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
+ 111:         if not ((not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))))):
  112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  113:         currentString += line1[linePos]
  114:         linePos += 1
  115:     travelData.lastName = currentString
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest_v2.TestMRTD)

   - [#  80] COI MRTD: 
--------------------------------------------------------------------------------
  114:         linePos += 1
  115:     travelData.lastName = currentString
  116:     linePos += 2
  117:     currentString = ''
- 118:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
+ 118:     while not ((linePos < LINE_LENGTH and line1[linePos] != '<')):
  119:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
  120:             raise Exception(('Invalid character ' + line1[linePos]) + ' in first name')
  121:         currentString += line1[linePos]
  122:         linePos += 1
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest_v2.TestMRTD)

   - [#  96] CRP MRTD: 
--------------------------------------------------------------------------------
   21:     
   22:     
   23:     
   24:     
-  25:     def __init__(self, dT='', iC='', lN='', fN='', mN='', passN='', pC='', cC='', b='', bC='', s='', eD='', eC='', perN='', perC=''):
+  25:     def __init__(self, dT='mutpy', iC='', lN='', fN='', mN='', passN='', pC='', cC='', b='', bC='', s='', eD='', eC='', perN='', perC=''):
   26:         self.docType = dT
   27:         self.issuingCountry = iC
   28:         self.lastName = lN
   29:         self.firstName = fN
--------------------------------------------------------------------------------
[0.00400 s] killed by testInitTravelData (MRTDtest_v2.TestMRTD)

   - [#  97] CRP MRTD: 
--------------------------------------------------------------------------------
   21:     
   22:     
   23:     
   24:     
-  25:     def __init__(self, dT='', iC='', lN='', fN='', mN='', passN='', pC='', cC='', b='', bC='', s='', eD='', eC='', perN='', perC=''):
+  25:     def __init__(self, dT='', iC='mutpy', lN='', fN='', mN='', passN='', pC='', cC='', b='', bC='', s='', eD='', eC='', perN='', perC=''):
   26:         self.docType = dT
   27:         self.issuingCountry = iC
   28:         self.lastName = lN
   29:         self.firstName = fN
--------------------------------------------------------------------------------
[0.00400 s] killed by testInitTravelData (MRTDtest_v2.TestMRTD)

   - [#  98] CRP MRTD: 
--------------------------------------------------------------------------------
   21:     
   22:     
   23:     
   24:     
-  25:     def __init__(self, dT='', iC='', lN='', fN='', mN='', passN='', pC='', cC='', b='', bC='', s='', eD='', eC='', perN='', perC=''):
+  25:     def __init__(self, dT='', iC='', lN='mutpy', fN='', mN='', passN='', pC='', cC='', b='', bC='', s='', eD='', eC='', perN='', perC=''):
   26:         self.docType = dT
   27:         self.issuingCountry = iC
   28:         self.lastName = lN
   29:         self.firstName = fN
--------------------------------------------------------------------------------
[0.00300 s] killed by testInitTravelData (MRTDtest_v2.TestMRTD)

   - [#  99] CRP MRTD: 
--------------------------------------------------------------------------------
   21:     
   22:     
   23:     
   24:     
-  25:     def __init__(self, dT='', iC='', lN='', fN='', mN='', passN='', pC='', cC='', b='', bC='', s='', eD='', eC='', perN='', perC=''):
+  25:     def __init__(self, dT='', iC='', lN='', fN='mutpy', mN='', passN='', pC='', cC='', b='', bC='', s='', eD='', eC='', perN='', perC=''):
   26:         self.docType = dT
   27:         self.issuingCountry = iC
   28:         self.lastName = lN
   29:         self.firstName = fN
--------------------------------------------------------------------------------
[0.00302 s] killed by testInitTravelData (MRTDtest_v2.TestMRTD)

   - [# 100] CRP MRTD: 
--------------------------------------------------------------------------------
   21:     
   22:     
   23:     
   24:     
-  25:     def __init__(self, dT='', iC='', lN='', fN='', mN='', passN='', pC='', cC='', b='', bC='', s='', eD='', eC='', perN='', perC=''):
+  25:     def __init__(self, dT='', iC='', lN='', fN='', mN='mutpy', passN='', pC='', cC='', b='', bC='', s='', eD='', eC='', perN='', perC=''):
   26:         self.docType = dT
   27:         self.issuingCountry = iC
   28:         self.lastName = lN
   29:         self.firstName = fN
--------------------------------------------------------------------------------
[0.00400 s] killed by testInitTravelData (MRTDtest_v2.TestMRTD)

   - [# 101] CRP MRTD: 
--------------------------------------------------------------------------------
   21:     
   22:     
   23:     
   24:     
-  25:     def __init__(self, dT='', iC='', lN='', fN='', mN='', passN='', pC='', cC='', b='', bC='', s='', eD='', eC='', perN='', perC=''):
+  25:     def __init__(self, dT='', iC='', lN='', fN='', mN='', passN='mutpy', pC='', cC='', b='', bC='', s='', eD='', eC='', perN='', perC=''):
   26:         self.docType = dT
   27:         self.issuingCountry = iC
   28:         self.lastName = lN
   29:         self.firstName = fN
--------------------------------------------------------------------------------
[0.00305 s] killed by testInitTravelData (MRTDtest_v2.TestMRTD)

   - [# 102] CRP MRTD: 
--------------------------------------------------------------------------------
   21:     
   22:     
   23:     
   24:     
-  25:     def __init__(self, dT='', iC='', lN='', fN='', mN='', passN='', pC='', cC='', b='', bC='', s='', eD='', eC='', perN='', perC=''):
+  25:     def __init__(self, dT='', iC='', lN='', fN='', mN='', passN='', pC='mutpy', cC='', b='', bC='', s='', eD='', eC='', perN='', perC=''):
   26:         self.docType = dT
   27:         self.issuingCountry = iC
   28:         self.lastName = lN
   29:         self.firstName = fN
--------------------------------------------------------------------------------
[0.00300 s] killed by testInitTravelData (MRTDtest_v2.TestMRTD)

   - [# 103] CRP MRTD: 
--------------------------------------------------------------------------------
   21:     
   22:     
   23:     
   24:     
-  25:     def __init__(self, dT='', iC='', lN='', fN='', mN='', passN='', pC='', cC='', b='', bC='', s='', eD='', eC='', perN='', perC=''):
+  25:     def __init__(self, dT='', iC='', lN='', fN='', mN='', passN='', pC='', cC='mutpy', b='', bC='', s='', eD='', eC='', perN='', perC=''):
   26:         self.docType = dT
   27:         self.issuingCountry = iC
   28:         self.lastName = lN
   29:         self.firstName = fN
--------------------------------------------------------------------------------
[0.00300 s] killed by testInitTravelData (MRTDtest_v2.TestMRTD)

   - [# 104] CRP MRTD: 
--------------------------------------------------------------------------------
   21:     
   22:     
   23:     
   24:     
-  25:     def __init__(self, dT='', iC='', lN='', fN='', mN='', passN='', pC='', cC='', b='', bC='', s='', eD='', eC='', perN='', perC=''):
+  25:     def __init__(self, dT='', iC='', lN='', fN='', mN='', passN='', pC='', cC='', b='mutpy', bC='', s='', eD='', eC='', perN='', perC=''):
   26:         self.docType = dT
   27:         self.issuingCountry = iC
   28:         self.lastName = lN
   29:         self.firstName = fN
--------------------------------------------------------------------------------
[0.00299 s] killed by testInitTravelData (MRTDtest_v2.TestMRTD)

   - [# 105] CRP MRTD: 
--------------------------------------------------------------------------------
   21:     
   22:     
   23:     
   24:     
-  25:     def __init__(self, dT='', iC='', lN='', fN='', mN='', passN='', pC='', cC='', b='', bC='', s='', eD='', eC='', perN='', perC=''):
+  25:     def __init__(self, dT='', iC='', lN='', fN='', mN='', passN='', pC='', cC='', b='', bC='mutpy', s='', eD='', eC='', perN='', perC=''):
   26:         self.docType = dT
   27:         self.issuingCountry = iC
   28:         self.lastName = lN
   29:         self.firstName = fN
--------------------------------------------------------------------------------
[0.00300 s] killed by testInitTravelData (MRTDtest_v2.TestMRTD)

   - [# 106] CRP MRTD: 
--------------------------------------------------------------------------------
   21:     
   22:     
   23:     
   24:     
-  25:     def __init__(self, dT='', iC='', lN='', fN='', mN='', passN='', pC='', cC='', b='', bC='', s='', eD='', eC='', perN='', perC=''):
+  25:     def __init__(self, dT='', iC='', lN='', fN='', mN='', passN='', pC='', cC='', b='', bC='', s='mutpy', eD='', eC='', perN='', perC=''):
   26:         self.docType = dT
   27:         self.issuingCountry = iC
   28:         self.lastName = lN
   29:         self.firstName = fN
--------------------------------------------------------------------------------
[0.00400 s] killed by testInitTravelData (MRTDtest_v2.TestMRTD)

   - [# 107] CRP MRTD: 
--------------------------------------------------------------------------------
   21:     
   22:     
   23:     
   24:     
-  25:     def __init__(self, dT='', iC='', lN='', fN='', mN='', passN='', pC='', cC='', b='', bC='', s='', eD='', eC='', perN='', perC=''):
+  25:     def __init__(self, dT='', iC='', lN='', fN='', mN='', passN='', pC='', cC='', b='', bC='', s='', eD='mutpy', eC='', perN='', perC=''):
   26:         self.docType = dT
   27:         self.issuingCountry = iC
   28:         self.lastName = lN
   29:         self.firstName = fN
--------------------------------------------------------------------------------
[0.00414 s] killed by testInitTravelData (MRTDtest_v2.TestMRTD)

   - [# 108] CRP MRTD: 
--------------------------------------------------------------------------------
   21:     
   22:     
   23:     
   24:     
-  25:     def __init__(self, dT='', iC='', lN='', fN='', mN='', passN='', pC='', cC='', b='', bC='', s='', eD='', eC='', perN='', perC=''):
+  25:     def __init__(self, dT='', iC='', lN='', fN='', mN='', passN='', pC='', cC='', b='', bC='', s='', eD='', eC='mutpy', perN='', perC=''):
   26:         self.docType = dT
   27:         self.issuingCountry = iC
   28:         self.lastName = lN
   29:         self.firstName = fN
--------------------------------------------------------------------------------
[0.00300 s] killed by testInitTravelData (MRTDtest_v2.TestMRTD)

   - [# 109] CRP MRTD: 
--------------------------------------------------------------------------------
   21:     
   22:     
   23:     
   24:     
-  25:     def __init__(self, dT='', iC='', lN='', fN='', mN='', passN='', pC='', cC='', b='', bC='', s='', eD='', eC='', perN='', perC=''):
+  25:     def __init__(self, dT='', iC='', lN='', fN='', mN='', passN='', pC='', cC='', b='', bC='', s='', eD='', eC='', perN='mutpy', perC=''):
   26:         self.docType = dT
   27:         self.issuingCountry = iC
   28:         self.lastName = lN
   29:         self.firstName = fN
--------------------------------------------------------------------------------
[0.00300 s] killed by testInitTravelData (MRTDtest_v2.TestMRTD)

   - [# 110] CRP MRTD: 
--------------------------------------------------------------------------------
   21:     
   22:     
   23:     
   24:     
-  25:     def __init__(self, dT='', iC='', lN='', fN='', mN='', passN='', pC='', cC='', b='', bC='', s='', eD='', eC='', perN='', perC=''):
+  25:     def __init__(self, dT='', iC='', lN='', fN='', mN='', passN='', pC='', cC='', b='', bC='', s='', eD='', eC='', perN='', perC='mutpy'):
   26:         self.docType = dT
   27:         self.issuingCountry = iC
   28:         self.lastName = lN
   29:         self.firstName = fN
--------------------------------------------------------------------------------
[0.00317 s] killed by testInitTravelData (MRTDtest_v2.TestMRTD)

   - [# 116] CRP MRTD: 
--------------------------------------------------------------------------------
   64:         return int(i)
   65:     except ValueError:
   66:         if (str(i) >= 'A' and str(i) <= 'Z'):
   67:             return int(ord(str(i)) - 55)
-  68:         elif (str(i) >= 'a' and str(i) <= 'z'):
+  68:         elif (str(i) >= 'mutpy' and str(i) <= 'z'):
   69:             return int(ord(str(i)) - 87)
   70:         else:
   71:             return 0
   72: 
--------------------------------------------------------------------------------
[0.00299 s] killed by testGetNumericalValue (MRTDtest_v2.TestMRTD)

   - [# 117] CRP MRTD: 
--------------------------------------------------------------------------------
   64:         return int(i)
   65:     except ValueError:
   66:         if (str(i) >= 'A' and str(i) <= 'Z'):
   67:             return int(ord(str(i)) - 55)
-  68:         elif (str(i) >= 'a' and str(i) <= 'z'):
+  68:         elif (str(i) >= '' and str(i) <= 'z'):
   69:             return int(ord(str(i)) - 87)
   70:         else:
   71:             return 0
   72: 
--------------------------------------------------------------------------------
[0.00000 s] killed by testCalculateCheck (MRTDtest_v2.TestMRTD)

   - [# 118] CRP MRTD: 
--------------------------------------------------------------------------------
   64:         return int(i)
   65:     except ValueError:
   66:         if (str(i) >= 'A' and str(i) <= 'Z'):
   67:             return int(ord(str(i)) - 55)
-  68:         elif (str(i) >= 'a' and str(i) <= 'z'):
+  68:         elif (str(i) >= 'a' and str(i) <= 'mutpy'):
   69:             return int(ord(str(i)) - 87)
   70:         else:
   71:             return 0
   72: 
--------------------------------------------------------------------------------
[0.00000 s] killed by testCalculateCheck (MRTDtest_v2.TestMRTD)

   - [# 119] CRP MRTD: 
--------------------------------------------------------------------------------
   64:         return int(i)
   65:     except ValueError:
   66:         if (str(i) >= 'A' and str(i) <= 'Z'):
   67:             return int(ord(str(i)) - 55)
-  68:         elif (str(i) >= 'a' and str(i) <= 'z'):
+  68:         elif (str(i) >= 'a' and str(i) <= ''):
   69:             return int(ord(str(i)) - 87)
   70:         else:
   71:             return 0
   72: 
--------------------------------------------------------------------------------
[0.00099 s] killed by testCalculateCheck (MRTDtest_v2.TestMRTD)

   - [# 120] CRP MRTD: 
--------------------------------------------------------------------------------
   65:     except ValueError:
   66:         if (str(i) >= 'A' and str(i) <= 'Z'):
   67:             return int(ord(str(i)) - 55)
   68:         elif (str(i) >= 'a' and str(i) <= 'z'):
-  69:             return int(ord(str(i)) - 87)
+  69:             return int(ord(str(i)) - 88)
   70:         else:
   71:             return 0
   72: 
   73: def calculateCheck(lst):
--------------------------------------------------------------------------------
[0.00420 s] killed by testGetNumericalValue (MRTDtest_v2.TestMRTD)

   - [# 149] CRP MRTD: 
--------------------------------------------------------------------------------
  106:     travelData.docType = line1[linePos:linePos + 1]
  107:     linePos += 2
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
- 110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
+ 110:     while (linePos < LINE_LENGTH and line1[linePos] != 'mutpy'):
  111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
  112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  113:         currentString += line1[linePos]
  114:         linePos += 1
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest_v2.TestMRTD)

   - [# 150] CRP MRTD: 
--------------------------------------------------------------------------------
  106:     travelData.docType = line1[linePos:linePos + 1]
  107:     linePos += 2
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
- 110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
+ 110:     while (linePos < LINE_LENGTH and line1[linePos] != ''):
  111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
  112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  113:         currentString += line1[linePos]
  114:         linePos += 1
--------------------------------------------------------------------------------
[0.00099 s] killed by testDecodeMRZ (MRTDtest_v2.TestMRTD)

   - [# 151] CRP MRTD: 
--------------------------------------------------------------------------------
  107:     linePos += 2
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
  110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
- 111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
+ 111:         if not (((line1[linePos] >= 'mutpy' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
  112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  113:         currentString += line1[linePos]
  114:         linePos += 1
  115:     travelData.lastName = currentString
--------------------------------------------------------------------------------
[0.00193 s] killed by testDecodeMRZ (MRTDtest_v2.TestMRTD)

   - [# 152] CRP MRTD: 
--------------------------------------------------------------------------------
  107:     linePos += 2
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
  110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
- 111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
+ 111:         if not (((line1[linePos] >= '' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
  112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  113:         currentString += line1[linePos]
  114:         linePos += 1
  115:     travelData.lastName = currentString
--------------------------------------------------------------------------------
[0.00207 s] killed by testDecodeMRZ6 (MRTDtest_v2.TestMRTD)

   - [# 153] CRP MRTD: 
--------------------------------------------------------------------------------
  107:     linePos += 2
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
  110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
- 111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
+ 111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'mutpy') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
  112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  113:         currentString += line1[linePos]
  114:         linePos += 1
  115:     travelData.lastName = currentString
--------------------------------------------------------------------------------
[0.00300 s] survived

   - [# 154] CRP MRTD: 
--------------------------------------------------------------------------------
  107:     linePos += 2
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
  110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
- 111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
+ 111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= '') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
  112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  113:         currentString += line1[linePos]
  114:         linePos += 1
  115:     travelData.lastName = currentString
--------------------------------------------------------------------------------
[0.00101 s] killed by testDecodeMRZ (MRTDtest_v2.TestMRTD)

   - [# 155] CRP MRTD: 
--------------------------------------------------------------------------------
  107:     linePos += 2
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
  110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
- 111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
+ 111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'mutpy' and line1[linePos] <= 'z'))):
  112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  113:         currentString += line1[linePos]
  114:         linePos += 1
  115:     travelData.lastName = currentString
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ13 (MRTDtest_v2.TestMRTD)
