   - [# 156] CRP MRTD: 
--------------------------------------------------------------------------------
  107:     linePos += 2
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
  110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
- 111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
+ 111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= '' and line1[linePos] <= 'z'))):
  112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  113:         currentString += line1[linePos]
  114:         linePos += 1
  115:     travelData.lastName = currentString
--------------------------------------------------------------------------------
[0.00300 s] killed by testDecodeMRZ6 (MRTDtest_v2.TestMRTD)

   - [# 157] CRP MRTD: 
--------------------------------------------------------------------------------
  107:     linePos += 2
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
  110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
- 111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
+ 111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'mutpy'))):
  112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  113:         currentString += line1[linePos]
  114:         linePos += 1
  115:     travelData.lastName = currentString
--------------------------------------------------------------------------------
[0.00200 s] killed by testDecodeMRZ13 (MRTDtest_v2.TestMRTD)

   - [# 158] CRP MRTD: 
--------------------------------------------------------------------------------
  107:     linePos += 2
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
  110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
- 111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
+ 111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= ''))):
  112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  113:         currentString += line1[linePos]
  114:         linePos += 1
  115:     travelData.lastName = currentString
--------------------------------------------------------------------------------
[0.00200 s] killed by testDecodeMRZ13 (MRTDtest_v2.TestMRTD)

   - [# 159] CRP MRTD: 
--------------------------------------------------------------------------------
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
  110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
  111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
- 112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
+ 112:             raise Exception(('mutpy' + line1[linePos]) + ' in last name')
  113:         currentString += line1[linePos]
  114:         linePos += 1
  115:     travelData.lastName = currentString
  116:     linePos += 2
--------------------------------------------------------------------------------
[0.00300 s] survived

   - [# 160] CRP MRTD: 
--------------------------------------------------------------------------------
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
  110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
  111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
- 112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
+ 112:             raise Exception(('' + line1[linePos]) + ' in last name')
  113:         currentString += line1[linePos]
  114:         linePos += 1
  115:     travelData.lastName = currentString
  116:     linePos += 2
--------------------------------------------------------------------------------
[0.00400 s] survived

   - [# 161] CRP MRTD: 
--------------------------------------------------------------------------------
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
  110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
  111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
- 112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
+ 112:             raise Exception(('Invalid character ' + line1[linePos]) + 'mutpy')
  113:         currentString += line1[linePos]
  114:         linePos += 1
  115:     travelData.lastName = currentString
  116:     linePos += 2
--------------------------------------------------------------------------------
[0.00401 s] survived

   - [# 162] CRP MRTD: 
--------------------------------------------------------------------------------
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
  110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
  111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
- 112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
+ 112:             raise Exception(('Invalid character ' + line1[linePos]) + '')
  113:         currentString += line1[linePos]
  114:         linePos += 1
  115:     travelData.lastName = currentString
  116:     linePos += 2
--------------------------------------------------------------------------------
[0.00300 s] survived

   - [# 166] CRP MRTD: 
--------------------------------------------------------------------------------
  114:         linePos += 1
  115:     travelData.lastName = currentString
  116:     linePos += 2
  117:     currentString = ''
- 118:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
+ 118:     while (linePos < LINE_LENGTH and line1[linePos] != 'mutpy'):
  119:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
  120:             raise Exception(('Invalid character ' + line1[linePos]) + ' in first name')
  121:         currentString += line1[linePos]
  122:         linePos += 1
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest_v2.TestMRTD)

   - [# 167] CRP MRTD: 
--------------------------------------------------------------------------------
  114:         linePos += 1
  115:     travelData.lastName = currentString
  116:     linePos += 2
  117:     currentString = ''
- 118:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
+ 118:     while (linePos < LINE_LENGTH and line1[linePos] != ''):
  119:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
  120:             raise Exception(('Invalid character ' + line1[linePos]) + ' in first name')
  121:         currentString += line1[linePos]
  122:         linePos += 1
--------------------------------------------------------------------------------
[0.00165 s] killed by testDecodeMRZ (MRTDtest_v2.TestMRTD)

   - [# 176] CRP MRTD: 
--------------------------------------------------------------------------------
  116:     linePos += 2
  117:     currentString = ''
  118:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
  119:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
- 120:             raise Exception(('Invalid character ' + line1[linePos]) + ' in first name')
+ 120:             raise Exception(('mutpy' + line1[linePos]) + ' in first name')
  121:         currentString += line1[linePos]
  122:         linePos += 1
  123:     travelData.firstName = currentString
  124:     linePos += 1
--------------------------------------------------------------------------------
[0.00613 s] survived

   - [# 177] CRP MRTD: 
--------------------------------------------------------------------------------
  116:     linePos += 2
  117:     currentString = ''
  118:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
  119:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
- 120:             raise Exception(('Invalid character ' + line1[linePos]) + ' in first name')
+ 120:             raise Exception(('' + line1[linePos]) + ' in first name')
  121:         currentString += line1[linePos]
  122:         linePos += 1
  123:     travelData.firstName = currentString
  124:     linePos += 1
--------------------------------------------------------------------------------
[0.00300 s] survived

   - [# 178] CRP MRTD: 
--------------------------------------------------------------------------------
  116:     linePos += 2
  117:     currentString = ''
  118:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
  119:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
- 120:             raise Exception(('Invalid character ' + line1[linePos]) + ' in first name')
+ 120:             raise Exception(('Invalid character ' + line1[linePos]) + 'mutpy')
  121:         currentString += line1[linePos]
  122:         linePos += 1
  123:     travelData.firstName = currentString
  124:     linePos += 1
--------------------------------------------------------------------------------
[0.00351 s] survived

   - [# 179] CRP MRTD: 
--------------------------------------------------------------------------------
  116:     linePos += 2
  117:     currentString = ''
  118:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
  119:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
- 120:             raise Exception(('Invalid character ' + line1[linePos]) + ' in first name')
+ 120:             raise Exception(('Invalid character ' + line1[linePos]) + '')
  121:         currentString += line1[linePos]
  122:         linePos += 1
  123:     travelData.firstName = currentString
  124:     linePos += 1
--------------------------------------------------------------------------------
[0.00384 s] survived

   - [# 193] CRP MRTD: 
--------------------------------------------------------------------------------
  124:     linePos += 1
  125:     currentString = ''
  126:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
  127:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
- 128:             raise Exception(('Invalid character ' + line1[linePos]) + ' in middle name')
+ 128:             raise Exception(('mutpy' + line1[linePos]) + ' in middle name')
  129:         currentString += line1[linePos]
  130:         linePos += 1
  131:     travelData.middleName = currentString
  132:     currentString = ''
--------------------------------------------------------------------------------
[0.00400 s] survived

   - [# 194] CRP MRTD: 
--------------------------------------------------------------------------------
  124:     linePos += 1
  125:     currentString = ''
  126:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
  127:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
- 128:             raise Exception(('Invalid character ' + line1[linePos]) + ' in middle name')
+ 128:             raise Exception(('' + line1[linePos]) + ' in middle name')
  129:         currentString += line1[linePos]
  130:         linePos += 1
  131:     travelData.middleName = currentString
  132:     currentString = ''
--------------------------------------------------------------------------------
[0.00399 s] survived

   - [# 195] CRP MRTD: 
--------------------------------------------------------------------------------
  124:     linePos += 1
  125:     currentString = ''
  126:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
  127:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
- 128:             raise Exception(('Invalid character ' + line1[linePos]) + ' in middle name')
+ 128:             raise Exception(('Invalid character ' + line1[linePos]) + 'mutpy')
  129:         currentString += line1[linePos]
  130:         linePos += 1
  131:     travelData.middleName = currentString
  132:     currentString = ''
--------------------------------------------------------------------------------
[0.00300 s] survived

   - [# 196] CRP MRTD: 
--------------------------------------------------------------------------------
  124:     linePos += 1
  125:     currentString = ''
  126:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
  127:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
- 128:             raise Exception(('Invalid character ' + line1[linePos]) + ' in middle name')
+ 128:             raise Exception(('Invalid character ' + line1[linePos]) + '')
  129:         currentString += line1[linePos]
  130:         linePos += 1
  131:     travelData.middleName = currentString
  132:     currentString = ''
--------------------------------------------------------------------------------
[0.00398 s] survived

   - [# 226] EHD MRTD: 
--------------------------------------------------------------------------------
   62:     try:
   63:         int(i)
   64:         return int(i)
   65:     except ValueError:
-  66:         if (str(i) >= 'A' and str(i) <= 'Z'):
-  67:             return int(ord(str(i)) - 55)
-  68:         elif (str(i) >= 'a' and str(i) <= 'z'):
-  69:             return int(ord(str(i)) - 87)
-  70:         else:
-  71:             return 0
+  66:         raise
+  67: 
+  68: 
+  69: 
+  70: 
+  71: 
   72: 
   73: def calculateCheck(lst):
   74:     weights = [7, 3, 1]
   75:     weightIdx = 0
--------------------------------------------------------------------------------
[0.00100 s] killed by testCalculateCheck (MRTDtest_v2.TestMRTD)

   - [# 229] LCR MRTD: 
--------------------------------------------------------------------------------
   64:         return int(i)
   65:     except ValueError:
   66:         if (str(i) >= 'A' and str(i) <= 'Z'):
   67:             return int(ord(str(i)) - 55)
-  68:         elif (str(i) >= 'a' and str(i) <= 'z'):
+  68:         elif (str(i) >= 'a' or str(i) <= 'z'):
   69:             return int(ord(str(i)) - 87)
   70:         else:
   71:             return 0
   72: 
--------------------------------------------------------------------------------
[0.00100 s] killed by testCalculateCheck (MRTDtest_v2.TestMRTD)

   - [# 233] LCR MRTD: 
--------------------------------------------------------------------------------
  106:     travelData.docType = line1[linePos:linePos + 1]
  107:     linePos += 2
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
- 110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
+ 110:     while (linePos < LINE_LENGTH or line1[linePos] != '<'):
  111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
  112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  113:         currentString += line1[linePos]
  114:         linePos += 1
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest_v2.TestMRTD)

   - [# 234] LCR MRTD: 
--------------------------------------------------------------------------------
  107:     linePos += 2
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
  110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
- 111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
+ 111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') and (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
  112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  113:         currentString += line1[linePos]
  114:         linePos += 1
  115:     travelData.lastName = currentString
--------------------------------------------------------------------------------
[0.00106 s] killed by testDecodeMRZ (MRTDtest_v2.TestMRTD)

   - [# 235] LCR MRTD: 
--------------------------------------------------------------------------------
  107:     linePos += 2
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
  110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
- 111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
+ 111:         if not (((line1[linePos] >= 'A' or line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
  112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  113:         currentString += line1[linePos]
  114:         linePos += 1
  115:     travelData.lastName = currentString
--------------------------------------------------------------------------------
[0.00200 s] killed by testDecodeMRZ6 (MRTDtest_v2.TestMRTD)

   - [# 236] LCR MRTD: 
--------------------------------------------------------------------------------
  107:     linePos += 2
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
  110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
- 111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
+ 111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' or line1[linePos] <= 'z'))):
  112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  113:         currentString += line1[linePos]
  114:         linePos += 1
  115:     travelData.lastName = currentString
--------------------------------------------------------------------------------
[0.00210 s] killed by testDecodeMRZ6 (MRTDtest_v2.TestMRTD)

   - [# 237] LCR MRTD: 
--------------------------------------------------------------------------------
  114:         linePos += 1
  115:     travelData.lastName = currentString
  116:     linePos += 2
  117:     currentString = ''
- 118:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
+ 118:     while (linePos < LINE_LENGTH or line1[linePos] != '<'):
  119:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
  120:             raise Exception(('Invalid character ' + line1[linePos]) + ' in first name')
  121:         currentString += line1[linePos]
  122:         linePos += 1
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest_v2.TestMRTD)

   - [# 249] ROR MRTD: 
--------------------------------------------------------------------------------
   64:         return int(i)
   65:     except ValueError:
   66:         if (str(i) >= 'A' and str(i) <= 'Z'):
   67:             return int(ord(str(i)) - 55)
-  68:         elif (str(i) >= 'a' and str(i) <= 'z'):
+  68:         elif (str(i) <= 'a' and str(i) <= 'z'):
   69:             return int(ord(str(i)) - 87)
   70:         else:
   71:             return 0
   72: 
--------------------------------------------------------------------------------
[0.00000 s] killed by testCalculateCheck (MRTDtest_v2.TestMRTD)

   - [# 250] ROR MRTD: 
--------------------------------------------------------------------------------
   64:         return int(i)
   65:     except ValueError:
   66:         if (str(i) >= 'A' and str(i) <= 'Z'):
   67:             return int(ord(str(i)) - 55)
-  68:         elif (str(i) >= 'a' and str(i) <= 'z'):
+  68:         elif (str(i) > 'a' and str(i) <= 'z'):
   69:             return int(ord(str(i)) - 87)
   70:         else:
   71:             return 0
   72: 
--------------------------------------------------------------------------------
[0.00415 s] killed by testGetNumericalValue (MRTDtest_v2.TestMRTD)

   - [# 251] ROR MRTD: 
--------------------------------------------------------------------------------
   64:         return int(i)
   65:     except ValueError:
   66:         if (str(i) >= 'A' and str(i) <= 'Z'):
   67:             return int(ord(str(i)) - 55)
-  68:         elif (str(i) >= 'a' and str(i) <= 'z'):
+  68:         elif (str(i) >= 'a' and str(i) >= 'z'):
   69:             return int(ord(str(i)) - 87)
   70:         else:
   71:             return 0
   72: 
--------------------------------------------------------------------------------
[0.00301 s] killed by testGetNumericalValue (MRTDtest_v2.TestMRTD)

   - [# 252] ROR MRTD: 
--------------------------------------------------------------------------------
   64:         return int(i)
   65:     except ValueError:
   66:         if (str(i) >= 'A' and str(i) <= 'Z'):
   67:             return int(ord(str(i)) - 55)
-  68:         elif (str(i) >= 'a' and str(i) <= 'z'):
+  68:         elif (str(i) >= 'a' and str(i) < 'z'):
   69:             return int(ord(str(i)) - 87)
   70:         else:
   71:             return 0
   72: 
--------------------------------------------------------------------------------
[0.00099 s] killed by testCalculateCheck (MRTDtest_v2.TestMRTD)

   - [# 260] ROR MRTD: 
--------------------------------------------------------------------------------
  106:     travelData.docType = line1[linePos:linePos + 1]
  107:     linePos += 2
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
- 110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
+ 110:     while (linePos > LINE_LENGTH and line1[linePos] != '<'):
  111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
  112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  113:         currentString += line1[linePos]
  114:         linePos += 1
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest_v2.TestMRTD)

   - [# 261] ROR MRTD: 
--------------------------------------------------------------------------------
  106:     travelData.docType = line1[linePos:linePos + 1]
  107:     linePos += 2
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
- 110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
+ 110:     while (linePos <= LINE_LENGTH and line1[linePos] != '<'):
  111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
  112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  113:         currentString += line1[linePos]
  114:         linePos += 1
--------------------------------------------------------------------------------
[0.00200 s] killed by testDecodeMRZ14 (MRTDtest_v2.TestMRTD)

   - [# 262] ROR MRTD: 
--------------------------------------------------------------------------------
  106:     travelData.docType = line1[linePos:linePos + 1]
  107:     linePos += 2
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
- 110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
+ 110:     while (linePos < LINE_LENGTH and line1[linePos] == '<'):
  111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
  112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  113:         currentString += line1[linePos]
  114:         linePos += 1
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest_v2.TestMRTD)

   - [# 263] ROR MRTD: 
--------------------------------------------------------------------------------
  107:     linePos += 2
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
  110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
- 111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
+ 111:         if not (((line1[linePos] <= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
  112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  113:         currentString += line1[linePos]
  114:         linePos += 1
  115:     travelData.lastName = currentString
--------------------------------------------------------------------------------
[0.00100 s] killed by testDecodeMRZ (MRTDtest_v2.TestMRTD)

   - [# 264] ROR MRTD: 
--------------------------------------------------------------------------------
  107:     linePos += 2
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
  110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
- 111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
+ 111:         if not (((line1[linePos] > 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
  112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  113:         currentString += line1[linePos]
  114:         linePos += 1
  115:     travelData.lastName = currentString
--------------------------------------------------------------------------------
[0.00212 s] killed by testDecodeMRZ13 (MRTDtest_v2.TestMRTD)

   - [# 265] ROR MRTD: 
--------------------------------------------------------------------------------
  107:     linePos += 2
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
  110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
- 111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
+ 111:         if not (((line1[linePos] >= 'A' and line1[linePos] >= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
  112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  113:         currentString += line1[linePos]
  114:         linePos += 1
  115:     travelData.lastName = currentString
--------------------------------------------------------------------------------
[0.00099 s] killed by testDecodeMRZ (MRTDtest_v2.TestMRTD)

   - [# 266] ROR MRTD: 
--------------------------------------------------------------------------------
  107:     linePos += 2
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
  110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
- 111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
+ 111:         if not (((line1[linePos] >= 'A' and line1[linePos] < 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
  112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  113:         currentString += line1[linePos]
  114:         linePos += 1
  115:     travelData.lastName = currentString
--------------------------------------------------------------------------------
[0.00200 s] killed by testDecodeMRZ13 (MRTDtest_v2.TestMRTD)

   - [# 267] ROR MRTD: 
--------------------------------------------------------------------------------
  107:     linePos += 2
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
  110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
- 111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
+ 111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] <= 'a' and line1[linePos] <= 'z'))):
  112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  113:         currentString += line1[linePos]
  114:         linePos += 1
  115:     travelData.lastName = currentString
--------------------------------------------------------------------------------
[0.00200 s] killed by testDecodeMRZ13 (MRTDtest_v2.TestMRTD)
