   - [# 268] ROR MRTD: 
--------------------------------------------------------------------------------
  107:     linePos += 2
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
  110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
- 111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
+ 111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] > 'a' and line1[linePos] <= 'z'))):
  112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  113:         currentString += line1[linePos]
  114:         linePos += 1
  115:     travelData.lastName = currentString
--------------------------------------------------------------------------------
[0.00194 s] killed by testDecodeMRZ13 (MRTDtest_v2.TestMRTD)

   - [# 269] ROR MRTD: 
--------------------------------------------------------------------------------
  107:     linePos += 2
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
  110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
- 111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
+ 111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] >= 'z'))):
  112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  113:         currentString += line1[linePos]
  114:         linePos += 1
  115:     travelData.lastName = currentString
--------------------------------------------------------------------------------
[0.00204 s] killed by testDecodeMRZ13 (MRTDtest_v2.TestMRTD)

   - [# 270] ROR MRTD: 
--------------------------------------------------------------------------------
  107:     linePos += 2
  108:     travelData.issuingCountry = line1[linePos:linePos + 3]
  109:     linePos += 3
  110:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
- 111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
+ 111:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] < 'z'))):
  112:             raise Exception(('Invalid character ' + line1[linePos]) + ' in last name')
  113:         currentString += line1[linePos]
  114:         linePos += 1
  115:     travelData.lastName = currentString
--------------------------------------------------------------------------------
[0.00200 s] killed by testDecodeMRZ13 (MRTDtest_v2.TestMRTD)

   - [# 271] ROR MRTD: 
--------------------------------------------------------------------------------
  114:         linePos += 1
  115:     travelData.lastName = currentString
  116:     linePos += 2
  117:     currentString = ''
- 118:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
+ 118:     while (linePos > LINE_LENGTH and line1[linePos] != '<'):
  119:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
  120:             raise Exception(('Invalid character ' + line1[linePos]) + ' in first name')
  121:         currentString += line1[linePos]
  122:         linePos += 1
--------------------------------------------------------------------------------
[0.00099 s] killed by testDecodeMRZ (MRTDtest_v2.TestMRTD)

   - [# 272] ROR MRTD: 
--------------------------------------------------------------------------------
  114:         linePos += 1
  115:     travelData.lastName = currentString
  116:     linePos += 2
  117:     currentString = ''
- 118:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
+ 118:     while (linePos <= LINE_LENGTH and line1[linePos] != '<'):
  119:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
  120:             raise Exception(('Invalid character ' + line1[linePos]) + ' in first name')
  121:         currentString += line1[linePos]
  122:         linePos += 1
--------------------------------------------------------------------------------
[0.00716 s] killed by testDecodeMRZ15 (MRTDtest_v2.TestMRTD)

   - [# 273] ROR MRTD: 
--------------------------------------------------------------------------------
  114:         linePos += 1
  115:     travelData.lastName = currentString
  116:     linePos += 2
  117:     currentString = ''
- 118:     while (linePos < LINE_LENGTH and line1[linePos] != '<'):
+ 118:     while (linePos < LINE_LENGTH and line1[linePos] == '<'):
  119:         if not (((line1[linePos] >= 'A' and line1[linePos] <= 'Z') or (line1[linePos] >= 'a' and line1[linePos] <= 'z'))):
  120:             raise Exception(('Invalid character ' + line1[linePos]) + ' in first name')
  121:         currentString += line1[linePos]
  122:         linePos += 1
--------------------------------------------------------------------------------
[0.00215 s] killed by testDecodeMRZ (MRTDtest_v2.TestMRTD)
